Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/xdmac.h
#define   XDMAC_CC_PERID_TC1_CPC_Val          _UINT32_(0x14)                                       /* (XDMAC_CC) TC1_CPC  */
#define   XDMAC_CC_PERID_TC4_CPC_Val          _UINT32_(0x15)                                       /* (XDMAC_CC) TC4_CPC  */
#define   XDMAC_CC_PERID_TC7_CPC_Val          _UINT32_(0x16)                                       /* (XDMAC_CC) TC7_CPC  */
#define   XDMAC_CC_PERID_TC1_ETRG_Val         _UINT32_(0x17)                                       /* (XDMAC_CC) TC1_ETRG  */
#define   XDMAC_CC_PERID_TC4_ETRG_Val         _UINT32_(0x18)                                       /* (XDMAC_CC) TC4_ETRG  */
#define   XDMAC_CC_PERID_TC7_ETRG_Val         _UINT32_(0x19)                                       /* (XDMAC_CC) TC7_ETRG  */
#define   XDMAC_CC_PERID_ADCC_Val             _UINT32_(0x1A)                                       /* (XDMAC_CC) ADCC  */
#define   XDMAC_CC_PERID_DACC_Val             _UINT32_(0x1B)                                       /* (XDMAC_CC) DACC  */
#define   XDMAC_CC_PERID_PCC_Val              _UINT32_(0x1C)                                       /* (XDMAC_CC) PCC  */
#define XDMAC_CC_PERID_FLEXCOM0_TX            (XDMAC_CC_PERID_FLEXCOM0_TX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM0_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM0_RX            (XDMAC_CC_PERID_FLEXCOM0_RX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM0_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM1_TX            (XDMAC_CC_PERID_FLEXCOM1_TX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM1_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM1_RX            (XDMAC_CC_PERID_FLEXCOM1_RX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM1_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM2_TX            (XDMAC_CC_PERID_FLEXCOM2_TX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM2_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM2_RX            (XDMAC_CC_PERID_FLEXCOM2_RX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM2_RX Position  */
#define XDMAC_CC_PERID_FLEXCOM3_TX            (XDMAC_CC_PERID_FLEXCOM3_TX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM3_TX Position  */
#define XDMAC_CC_PERID_FLEXCOM3_RX            (XDMAC_CC_PERID_FLEXCOM3_RX_Val << XDMAC_CC_PERID_Pos) /* (XDMAC_CC) FLEXCOM3_RX Position  */
#define XDMAC_CC_PERID_PWM0                   (XDMAC_CC_PERID_PWM0_Val << XDMAC_CC_PERID_Pos)      /* (XDMAC_CC) PWM0 Position  */
#define XDMAC_CC_PERID_PWM1                   (XDMAC_CC_PERID_PWM1_Val << XDMAC_CC_PERID_Pos)      /* (XDMAC_CC) PWM1 Position  */
#define XDMAC_CC_PERID_TC0                    (XDMAC_CC_PERID_TC0_Val << XDMAC_CC_PERID_Pos)       /* (XDMAC_CC) TC0 Position  */
#define XDMAC_CC_PERID_TC1                    (XDMAC_CC_PERID_TC1_Val << XDMAC_CC_PERID_Pos)       /* (XDMAC_CC) TC1 Position  */
#define XDMAC_CC_PERID_TC2                    (XDMAC_CC_PERID_TC2_Val << XDMAC_CC_PERID_Pos)       /* (XDMAC_CC) TC2 Position  */
#define XDMAC_CC_PERID_SHA                    (XDMAC_CC_PERID_SHA_Val << XDMAC_CC_PERID_Pos)       /* (XDMAC_CC) SHA Position  */
#define XDMAC_CC_PERID_TC1_CPA                (XDMAC_CC_PERID_TC1_CPA_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) TC1_CPA Position  */
#define XDMAC_CC_PERID_TC4_CPA                (XDMAC_CC_PERID_TC4_CPA_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) TC4_CPA Position  */
#define XDMAC_CC_PERID_TC7_CPA                (XDMAC_CC_PERID_TC7_CPA_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) TC7_CPA Position  */
#define XDMAC_CC_PERID_TC1_CPB                (XDMAC_CC_PERID_TC1_CPB_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) TC1_CPB Position  */
#define XDMAC_CC_PERID_TC4_CPB                (XDMAC_CC_PERID_TC4_CPB_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) TC4_CPB Position  */
#define XDMAC_CC_PERID_TC7_CPB                (XDMAC_CC_PERID_TC7_CPB_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) TC7_CPB Position  */
#define XDMAC_CC_PERID_TC1_CPC                (XDMAC_CC_PERID_TC1_CPC_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) TC1_CPC Position  */
#define XDMAC_CC_PERID_TC4_CPC                (XDMAC_CC_PERID_TC4_CPC_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) TC4_CPC Position  */
#define XDMAC_CC_PERID_TC7_CPC                (XDMAC_CC_PERID_TC7_CPC_Val << XDMAC_CC_PERID_Pos)   /* (XDMAC_CC) TC7_CPC Position  */
#define XDMAC_CC_PERID_TC1_ETRG               (XDMAC_CC_PERID_TC1_ETRG_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) TC1_ETRG Position  */
#define XDMAC_CC_PERID_TC4_ETRG               (XDMAC_CC_PERID_TC4_ETRG_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) TC4_ETRG Position  */
#define XDMAC_CC_PERID_TC7_ETRG               (XDMAC_CC_PERID_TC7_ETRG_Val << XDMAC_CC_PERID_Pos)  /* (XDMAC_CC) TC7_ETRG Position  */
#define XDMAC_CC_PERID_ADCC                   (XDMAC_CC_PERID_ADCC_Val << XDMAC_CC_PERID_Pos)      /* (XDMAC_CC) ADCC Position  */
#define XDMAC_CC_PERID_DACC                   (XDMAC_CC_PERID_DACC_Val << XDMAC_CC_PERID_Pos)      /* (XDMAC_CC) DACC Position  */
#define XDMAC_CC_PERID_PCC                    (XDMAC_CC_PERID_PCC_Val << XDMAC_CC_PERID_Pos)       /* (XDMAC_CC) PCC Position  */
#define XDMAC_CC_Msk                          _UINT32_(0x7FEF7FF7)                                 /* (XDMAC_CC) Register Mask  */


/* -------- XDMAC_CDS_MSP : (XDMAC Offset: 0x2C) (R/W 32) Channel Data Stride Memory Set Pattern -------- */
#define XDMAC_CDS_MSP_SDS_MSP_Pos             _UINT32_(0)                                          /* (XDMAC_CDS_MSP) Channel x Source Data stride or Memory Set Pattern Position */
#define XDMAC_CDS_MSP_SDS_MSP_Msk             (_UINT32_(0xFFFF) << XDMAC_CDS_MSP_SDS_MSP_Pos)      /* (XDMAC_CDS_MSP) Channel x Source Data stride or Memory Set Pattern Mask */
#define XDMAC_CDS_MSP_SDS_MSP(value)          (XDMAC_CDS_MSP_SDS_MSP_Msk & (_UINT32_(value) << XDMAC_CDS_MSP_SDS_MSP_Pos)) /* Assigment of value for SDS_MSP in the XDMAC_CDS_MSP register */
#define XDMAC_CDS_MSP_DDS_MSP_Pos             _UINT32_(16)                                         /* (XDMAC_CDS_MSP) Channel x Destination Data Stride or Memory Set Pattern Position */
#define XDMAC_CDS_MSP_DDS_MSP_Msk             (_UINT32_(0xFFFF) << XDMAC_CDS_MSP_DDS_MSP_Pos)      /* (XDMAC_CDS_MSP) Channel x Destination Data Stride or Memory Set Pattern Mask */
#define XDMAC_CDS_MSP_DDS_MSP(value)          (XDMAC_CDS_MSP_DDS_MSP_Msk & (_UINT32_(value) << XDMAC_CDS_MSP_DDS_MSP_Pos)) /* Assigment of value for DDS_MSP in the XDMAC_CDS_MSP register */
#define XDMAC_CDS_MSP_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (XDMAC_CDS_MSP) Register Mask  */


/* -------- XDMAC_CSUS : (XDMAC Offset: 0x30) (R/W 32) Channel Source Microblock Stride -------- */
#define XDMAC_CSUS_SUBS_Pos                   _UINT32_(0)                                          /* (XDMAC_CSUS) Channel x Source Microblock Stride Position */
#define XDMAC_CSUS_SUBS_Msk                   (_UINT32_(0xFFFFFF) << XDMAC_CSUS_SUBS_Pos)          /* (XDMAC_CSUS) Channel x Source Microblock Stride Mask */
#define XDMAC_CSUS_SUBS(value)                (XDMAC_CSUS_SUBS_Msk & (_UINT32_(value) << XDMAC_CSUS_SUBS_Pos)) /* Assigment of value for SUBS in the XDMAC_CSUS register */
#define XDMAC_CSUS_Msk                        _UINT32_(0x00FFFFFF)                                 /* (XDMAC_CSUS) Register Mask  */


