Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/xdmac.h
/* -------- XDMAC_GIS : (XDMAC Offset: 0x18) ( R/ 32) Global Interrupt Status Register -------- */
#define XDMAC_GIS_IS0_Pos                     _UINT32_(0)                                          /* (XDMAC_GIS) XDMAC Channel 0 Interrupt Status Bit Position */
#define XDMAC_GIS_IS0_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS0_Pos)                 /* (XDMAC_GIS) XDMAC Channel 0 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS0(value)                  (XDMAC_GIS_IS0_Msk & (_UINT32_(value) << XDMAC_GIS_IS0_Pos)) /* Assigment of value for IS0 in the XDMAC_GIS register */
#define XDMAC_GIS_IS1_Pos                     _UINT32_(1)                                          /* (XDMAC_GIS) XDMAC Channel 1 Interrupt Status Bit Position */
#define XDMAC_GIS_IS1_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS1_Pos)                 /* (XDMAC_GIS) XDMAC Channel 1 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS1(value)                  (XDMAC_GIS_IS1_Msk & (_UINT32_(value) << XDMAC_GIS_IS1_Pos)) /* Assigment of value for IS1 in the XDMAC_GIS register */
#define XDMAC_GIS_IS2_Pos                     _UINT32_(2)                                          /* (XDMAC_GIS) XDMAC Channel 2 Interrupt Status Bit Position */
#define XDMAC_GIS_IS2_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS2_Pos)                 /* (XDMAC_GIS) XDMAC Channel 2 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS2(value)                  (XDMAC_GIS_IS2_Msk & (_UINT32_(value) << XDMAC_GIS_IS2_Pos)) /* Assigment of value for IS2 in the XDMAC_GIS register */
#define XDMAC_GIS_IS3_Pos                     _UINT32_(3)                                          /* (XDMAC_GIS) XDMAC Channel 3 Interrupt Status Bit Position */
#define XDMAC_GIS_IS3_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS3_Pos)                 /* (XDMAC_GIS) XDMAC Channel 3 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS3(value)                  (XDMAC_GIS_IS3_Msk & (_UINT32_(value) << XDMAC_GIS_IS3_Pos)) /* Assigment of value for IS3 in the XDMAC_GIS register */
#define XDMAC_GIS_IS4_Pos                     _UINT32_(4)                                          /* (XDMAC_GIS) XDMAC Channel 4 Interrupt Status Bit Position */
#define XDMAC_GIS_IS4_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS4_Pos)                 /* (XDMAC_GIS) XDMAC Channel 4 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS4(value)                  (XDMAC_GIS_IS4_Msk & (_UINT32_(value) << XDMAC_GIS_IS4_Pos)) /* Assigment of value for IS4 in the XDMAC_GIS register */
#define XDMAC_GIS_IS5_Pos                     _UINT32_(5)                                          /* (XDMAC_GIS) XDMAC Channel 5 Interrupt Status Bit Position */
#define XDMAC_GIS_IS5_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS5_Pos)                 /* (XDMAC_GIS) XDMAC Channel 5 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS5(value)                  (XDMAC_GIS_IS5_Msk & (_UINT32_(value) << XDMAC_GIS_IS5_Pos)) /* Assigment of value for IS5 in the XDMAC_GIS register */
#define XDMAC_GIS_IS6_Pos                     _UINT32_(6)                                          /* (XDMAC_GIS) XDMAC Channel 6 Interrupt Status Bit Position */
#define XDMAC_GIS_IS6_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS6_Pos)                 /* (XDMAC_GIS) XDMAC Channel 6 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS6(value)                  (XDMAC_GIS_IS6_Msk & (_UINT32_(value) << XDMAC_GIS_IS6_Pos)) /* Assigment of value for IS6 in the XDMAC_GIS register */
#define XDMAC_GIS_IS7_Pos                     _UINT32_(7)                                          /* (XDMAC_GIS) XDMAC Channel 7 Interrupt Status Bit Position */
#define XDMAC_GIS_IS7_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS7_Pos)                 /* (XDMAC_GIS) XDMAC Channel 7 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS7(value)                  (XDMAC_GIS_IS7_Msk & (_UINT32_(value) << XDMAC_GIS_IS7_Pos)) /* Assigment of value for IS7 in the XDMAC_GIS register */
#define XDMAC_GIS_IS8_Pos                     _UINT32_(8)                                          /* (XDMAC_GIS) XDMAC Channel 8 Interrupt Status Bit Position */
#define XDMAC_GIS_IS8_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS8_Pos)                 /* (XDMAC_GIS) XDMAC Channel 8 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS8(value)                  (XDMAC_GIS_IS8_Msk & (_UINT32_(value) << XDMAC_GIS_IS8_Pos)) /* Assigment of value for IS8 in the XDMAC_GIS register */
#define XDMAC_GIS_IS9_Pos                     _UINT32_(9)                                          /* (XDMAC_GIS) XDMAC Channel 9 Interrupt Status Bit Position */
#define XDMAC_GIS_IS9_Msk                     (_UINT32_(0x1) << XDMAC_GIS_IS9_Pos)                 /* (XDMAC_GIS) XDMAC Channel 9 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS9(value)                  (XDMAC_GIS_IS9_Msk & (_UINT32_(value) << XDMAC_GIS_IS9_Pos)) /* Assigment of value for IS9 in the XDMAC_GIS register */
#define XDMAC_GIS_IS10_Pos                    _UINT32_(10)                                         /* (XDMAC_GIS) XDMAC Channel 10 Interrupt Status Bit Position */
#define XDMAC_GIS_IS10_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS10_Pos)                /* (XDMAC_GIS) XDMAC Channel 10 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS10(value)                 (XDMAC_GIS_IS10_Msk & (_UINT32_(value) << XDMAC_GIS_IS10_Pos)) /* Assigment of value for IS10 in the XDMAC_GIS register */
#define XDMAC_GIS_IS11_Pos                    _UINT32_(11)                                         /* (XDMAC_GIS) XDMAC Channel 11 Interrupt Status Bit Position */
#define XDMAC_GIS_IS11_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS11_Pos)                /* (XDMAC_GIS) XDMAC Channel 11 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS11(value)                 (XDMAC_GIS_IS11_Msk & (_UINT32_(value) << XDMAC_GIS_IS11_Pos)) /* Assigment of value for IS11 in the XDMAC_GIS register */
#define XDMAC_GIS_IS12_Pos                    _UINT32_(12)                                         /* (XDMAC_GIS) XDMAC Channel 12 Interrupt Status Bit Position */
#define XDMAC_GIS_IS12_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS12_Pos)                /* (XDMAC_GIS) XDMAC Channel 12 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS12(value)                 (XDMAC_GIS_IS12_Msk & (_UINT32_(value) << XDMAC_GIS_IS12_Pos)) /* Assigment of value for IS12 in the XDMAC_GIS register */
#define XDMAC_GIS_IS13_Pos                    _UINT32_(13)                                         /* (XDMAC_GIS) XDMAC Channel 13 Interrupt Status Bit Position */
#define XDMAC_GIS_IS13_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS13_Pos)                /* (XDMAC_GIS) XDMAC Channel 13 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS13(value)                 (XDMAC_GIS_IS13_Msk & (_UINT32_(value) << XDMAC_GIS_IS13_Pos)) /* Assigment of value for IS13 in the XDMAC_GIS register */
#define XDMAC_GIS_IS14_Pos                    _UINT32_(14)                                         /* (XDMAC_GIS) XDMAC Channel 14 Interrupt Status Bit Position */
#define XDMAC_GIS_IS14_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS14_Pos)                /* (XDMAC_GIS) XDMAC Channel 14 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS14(value)                 (XDMAC_GIS_IS14_Msk & (_UINT32_(value) << XDMAC_GIS_IS14_Pos)) /* Assigment of value for IS14 in the XDMAC_GIS register */
#define XDMAC_GIS_IS15_Pos                    _UINT32_(15)                                         /* (XDMAC_GIS) XDMAC Channel 15 Interrupt Status Bit Position */
#define XDMAC_GIS_IS15_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS15_Pos)                /* (XDMAC_GIS) XDMAC Channel 15 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS15(value)                 (XDMAC_GIS_IS15_Msk & (_UINT32_(value) << XDMAC_GIS_IS15_Pos)) /* Assigment of value for IS15 in the XDMAC_GIS register */
#define XDMAC_GIS_IS16_Pos                    _UINT32_(16)                                         /* (XDMAC_GIS) XDMAC Channel 16 Interrupt Status Bit Position */
#define XDMAC_GIS_IS16_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS16_Pos)                /* (XDMAC_GIS) XDMAC Channel 16 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS16(value)                 (XDMAC_GIS_IS16_Msk & (_UINT32_(value) << XDMAC_GIS_IS16_Pos)) /* Assigment of value for IS16 in the XDMAC_GIS register */
#define XDMAC_GIS_IS17_Pos                    _UINT32_(17)                                         /* (XDMAC_GIS) XDMAC Channel 17 Interrupt Status Bit Position */
#define XDMAC_GIS_IS17_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS17_Pos)                /* (XDMAC_GIS) XDMAC Channel 17 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS17(value)                 (XDMAC_GIS_IS17_Msk & (_UINT32_(value) << XDMAC_GIS_IS17_Pos)) /* Assigment of value for IS17 in the XDMAC_GIS register */
#define XDMAC_GIS_IS18_Pos                    _UINT32_(18)                                         /* (XDMAC_GIS) XDMAC Channel 18 Interrupt Status Bit Position */
#define XDMAC_GIS_IS18_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS18_Pos)                /* (XDMAC_GIS) XDMAC Channel 18 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS18(value)                 (XDMAC_GIS_IS18_Msk & (_UINT32_(value) << XDMAC_GIS_IS18_Pos)) /* Assigment of value for IS18 in the XDMAC_GIS register */
#define XDMAC_GIS_IS19_Pos                    _UINT32_(19)                                         /* (XDMAC_GIS) XDMAC Channel 19 Interrupt Status Bit Position */
#define XDMAC_GIS_IS19_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS19_Pos)                /* (XDMAC_GIS) XDMAC Channel 19 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS19(value)                 (XDMAC_GIS_IS19_Msk & (_UINT32_(value) << XDMAC_GIS_IS19_Pos)) /* Assigment of value for IS19 in the XDMAC_GIS register */
#define XDMAC_GIS_IS20_Pos                    _UINT32_(20)                                         /* (XDMAC_GIS) XDMAC Channel 20 Interrupt Status Bit Position */
#define XDMAC_GIS_IS20_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS20_Pos)                /* (XDMAC_GIS) XDMAC Channel 20 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS20(value)                 (XDMAC_GIS_IS20_Msk & (_UINT32_(value) << XDMAC_GIS_IS20_Pos)) /* Assigment of value for IS20 in the XDMAC_GIS register */
#define XDMAC_GIS_IS21_Pos                    _UINT32_(21)                                         /* (XDMAC_GIS) XDMAC Channel 21 Interrupt Status Bit Position */
#define XDMAC_GIS_IS21_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS21_Pos)                /* (XDMAC_GIS) XDMAC Channel 21 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS21(value)                 (XDMAC_GIS_IS21_Msk & (_UINT32_(value) << XDMAC_GIS_IS21_Pos)) /* Assigment of value for IS21 in the XDMAC_GIS register */
#define XDMAC_GIS_IS22_Pos                    _UINT32_(22)                                         /* (XDMAC_GIS) XDMAC Channel 22 Interrupt Status Bit Position */
#define XDMAC_GIS_IS22_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS22_Pos)                /* (XDMAC_GIS) XDMAC Channel 22 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS22(value)                 (XDMAC_GIS_IS22_Msk & (_UINT32_(value) << XDMAC_GIS_IS22_Pos)) /* Assigment of value for IS22 in the XDMAC_GIS register */
#define XDMAC_GIS_IS23_Pos                    _UINT32_(23)                                         /* (XDMAC_GIS) XDMAC Channel 23 Interrupt Status Bit Position */
#define XDMAC_GIS_IS23_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS23_Pos)                /* (XDMAC_GIS) XDMAC Channel 23 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS23(value)                 (XDMAC_GIS_IS23_Msk & (_UINT32_(value) << XDMAC_GIS_IS23_Pos)) /* Assigment of value for IS23 in the XDMAC_GIS register */
#define XDMAC_GIS_IS24_Pos                    _UINT32_(24)                                         /* (XDMAC_GIS) XDMAC Channel 24 Interrupt Status Bit Position */
#define XDMAC_GIS_IS24_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS24_Pos)                /* (XDMAC_GIS) XDMAC Channel 24 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS24(value)                 (XDMAC_GIS_IS24_Msk & (_UINT32_(value) << XDMAC_GIS_IS24_Pos)) /* Assigment of value for IS24 in the XDMAC_GIS register */
#define XDMAC_GIS_IS25_Pos                    _UINT32_(25)                                         /* (XDMAC_GIS) XDMAC Channel 25 Interrupt Status Bit Position */
#define XDMAC_GIS_IS25_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS25_Pos)                /* (XDMAC_GIS) XDMAC Channel 25 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS25(value)                 (XDMAC_GIS_IS25_Msk & (_UINT32_(value) << XDMAC_GIS_IS25_Pos)) /* Assigment of value for IS25 in the XDMAC_GIS register */
#define XDMAC_GIS_IS26_Pos                    _UINT32_(26)                                         /* (XDMAC_GIS) XDMAC Channel 26 Interrupt Status Bit Position */
#define XDMAC_GIS_IS26_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS26_Pos)                /* (XDMAC_GIS) XDMAC Channel 26 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS26(value)                 (XDMAC_GIS_IS26_Msk & (_UINT32_(value) << XDMAC_GIS_IS26_Pos)) /* Assigment of value for IS26 in the XDMAC_GIS register */
#define XDMAC_GIS_IS27_Pos                    _UINT32_(27)                                         /* (XDMAC_GIS) XDMAC Channel 27 Interrupt Status Bit Position */
#define XDMAC_GIS_IS27_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS27_Pos)                /* (XDMAC_GIS) XDMAC Channel 27 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS27(value)                 (XDMAC_GIS_IS27_Msk & (_UINT32_(value) << XDMAC_GIS_IS27_Pos)) /* Assigment of value for IS27 in the XDMAC_GIS register */
#define XDMAC_GIS_IS28_Pos                    _UINT32_(28)                                         /* (XDMAC_GIS) XDMAC Channel 28 Interrupt Status Bit Position */
#define XDMAC_GIS_IS28_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS28_Pos)                /* (XDMAC_GIS) XDMAC Channel 28 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS28(value)                 (XDMAC_GIS_IS28_Msk & (_UINT32_(value) << XDMAC_GIS_IS28_Pos)) /* Assigment of value for IS28 in the XDMAC_GIS register */
#define XDMAC_GIS_IS29_Pos                    _UINT32_(29)                                         /* (XDMAC_GIS) XDMAC Channel 29 Interrupt Status Bit Position */
#define XDMAC_GIS_IS29_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS29_Pos)                /* (XDMAC_GIS) XDMAC Channel 29 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS29(value)                 (XDMAC_GIS_IS29_Msk & (_UINT32_(value) << XDMAC_GIS_IS29_Pos)) /* Assigment of value for IS29 in the XDMAC_GIS register */
#define XDMAC_GIS_IS30_Pos                    _UINT32_(30)                                         /* (XDMAC_GIS) XDMAC Channel 30 Interrupt Status Bit Position */
#define XDMAC_GIS_IS30_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS30_Pos)                /* (XDMAC_GIS) XDMAC Channel 30 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS30(value)                 (XDMAC_GIS_IS30_Msk & (_UINT32_(value) << XDMAC_GIS_IS30_Pos)) /* Assigment of value for IS30 in the XDMAC_GIS register */
#define XDMAC_GIS_IS31_Pos                    _UINT32_(31)                                         /* (XDMAC_GIS) XDMAC Channel 31 Interrupt Status Bit Position */
#define XDMAC_GIS_IS31_Msk                    (_UINT32_(0x1) << XDMAC_GIS_IS31_Pos)                /* (XDMAC_GIS) XDMAC Channel 31 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS31(value)                 (XDMAC_GIS_IS31_Msk & (_UINT32_(value) << XDMAC_GIS_IS31_Pos)) /* Assigment of value for IS31 in the XDMAC_GIS register */
#define XDMAC_GIS_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (XDMAC_GIS) Register Mask  */

#define XDMAC_GIS_IS_Pos                      _UINT32_(0)                                          /* (XDMAC_GIS Position) XDMAC Channel 3x Interrupt Status Bit */
#define XDMAC_GIS_IS_Msk                      (_UINT32_(0xFFFFFFFF) << XDMAC_GIS_IS_Pos)           /* (XDMAC_GIS Mask) IS */
#define XDMAC_GIS_IS(value)                   (XDMAC_GIS_IS_Msk & (_UINT32_(value) << XDMAC_GIS_IS_Pos)) 

