Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/xdmac.h
/* -------- XDMAC_GE : (XDMAC Offset: 0x1C) ( /W 32) Global Channel Enable Register -------- */
#define XDMAC_GE_EN0_Pos                      _UINT32_(0)                                          /* (XDMAC_GE) XDMAC Channel 0 Enable Bit Position */
#define XDMAC_GE_EN0_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN0_Pos)                  /* (XDMAC_GE) XDMAC Channel 0 Enable Bit Mask */
#define XDMAC_GE_EN0(value)                   (XDMAC_GE_EN0_Msk & (_UINT32_(value) << XDMAC_GE_EN0_Pos)) /* Assigment of value for EN0 in the XDMAC_GE register */
#define XDMAC_GE_EN1_Pos                      _UINT32_(1)                                          /* (XDMAC_GE) XDMAC Channel 1 Enable Bit Position */
#define XDMAC_GE_EN1_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN1_Pos)                  /* (XDMAC_GE) XDMAC Channel 1 Enable Bit Mask */
#define XDMAC_GE_EN1(value)                   (XDMAC_GE_EN1_Msk & (_UINT32_(value) << XDMAC_GE_EN1_Pos)) /* Assigment of value for EN1 in the XDMAC_GE register */
#define XDMAC_GE_EN2_Pos                      _UINT32_(2)                                          /* (XDMAC_GE) XDMAC Channel 2 Enable Bit Position */
#define XDMAC_GE_EN2_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN2_Pos)                  /* (XDMAC_GE) XDMAC Channel 2 Enable Bit Mask */
#define XDMAC_GE_EN2(value)                   (XDMAC_GE_EN2_Msk & (_UINT32_(value) << XDMAC_GE_EN2_Pos)) /* Assigment of value for EN2 in the XDMAC_GE register */
#define XDMAC_GE_EN3_Pos                      _UINT32_(3)                                          /* (XDMAC_GE) XDMAC Channel 3 Enable Bit Position */
#define XDMAC_GE_EN3_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN3_Pos)                  /* (XDMAC_GE) XDMAC Channel 3 Enable Bit Mask */
#define XDMAC_GE_EN3(value)                   (XDMAC_GE_EN3_Msk & (_UINT32_(value) << XDMAC_GE_EN3_Pos)) /* Assigment of value for EN3 in the XDMAC_GE register */
#define XDMAC_GE_EN4_Pos                      _UINT32_(4)                                          /* (XDMAC_GE) XDMAC Channel 4 Enable Bit Position */
#define XDMAC_GE_EN4_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN4_Pos)                  /* (XDMAC_GE) XDMAC Channel 4 Enable Bit Mask */
#define XDMAC_GE_EN4(value)                   (XDMAC_GE_EN4_Msk & (_UINT32_(value) << XDMAC_GE_EN4_Pos)) /* Assigment of value for EN4 in the XDMAC_GE register */
#define XDMAC_GE_EN5_Pos                      _UINT32_(5)                                          /* (XDMAC_GE) XDMAC Channel 5 Enable Bit Position */
#define XDMAC_GE_EN5_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN5_Pos)                  /* (XDMAC_GE) XDMAC Channel 5 Enable Bit Mask */
#define XDMAC_GE_EN5(value)                   (XDMAC_GE_EN5_Msk & (_UINT32_(value) << XDMAC_GE_EN5_Pos)) /* Assigment of value for EN5 in the XDMAC_GE register */
#define XDMAC_GE_EN6_Pos                      _UINT32_(6)                                          /* (XDMAC_GE) XDMAC Channel 6 Enable Bit Position */
#define XDMAC_GE_EN6_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN6_Pos)                  /* (XDMAC_GE) XDMAC Channel 6 Enable Bit Mask */
#define XDMAC_GE_EN6(value)                   (XDMAC_GE_EN6_Msk & (_UINT32_(value) << XDMAC_GE_EN6_Pos)) /* Assigment of value for EN6 in the XDMAC_GE register */
#define XDMAC_GE_EN7_Pos                      _UINT32_(7)                                          /* (XDMAC_GE) XDMAC Channel 7 Enable Bit Position */
#define XDMAC_GE_EN7_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN7_Pos)                  /* (XDMAC_GE) XDMAC Channel 7 Enable Bit Mask */
#define XDMAC_GE_EN7(value)                   (XDMAC_GE_EN7_Msk & (_UINT32_(value) << XDMAC_GE_EN7_Pos)) /* Assigment of value for EN7 in the XDMAC_GE register */
#define XDMAC_GE_EN8_Pos                      _UINT32_(8)                                          /* (XDMAC_GE) XDMAC Channel 8 Enable Bit Position */
#define XDMAC_GE_EN8_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN8_Pos)                  /* (XDMAC_GE) XDMAC Channel 8 Enable Bit Mask */
#define XDMAC_GE_EN8(value)                   (XDMAC_GE_EN8_Msk & (_UINT32_(value) << XDMAC_GE_EN8_Pos)) /* Assigment of value for EN8 in the XDMAC_GE register */
#define XDMAC_GE_EN9_Pos                      _UINT32_(9)                                          /* (XDMAC_GE) XDMAC Channel 9 Enable Bit Position */
#define XDMAC_GE_EN9_Msk                      (_UINT32_(0x1) << XDMAC_GE_EN9_Pos)                  /* (XDMAC_GE) XDMAC Channel 9 Enable Bit Mask */
#define XDMAC_GE_EN9(value)                   (XDMAC_GE_EN9_Msk & (_UINT32_(value) << XDMAC_GE_EN9_Pos)) /* Assigment of value for EN9 in the XDMAC_GE register */
#define XDMAC_GE_EN10_Pos                     _UINT32_(10)                                         /* (XDMAC_GE) XDMAC Channel 10 Enable Bit Position */
#define XDMAC_GE_EN10_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN10_Pos)                 /* (XDMAC_GE) XDMAC Channel 10 Enable Bit Mask */
#define XDMAC_GE_EN10(value)                  (XDMAC_GE_EN10_Msk & (_UINT32_(value) << XDMAC_GE_EN10_Pos)) /* Assigment of value for EN10 in the XDMAC_GE register */
#define XDMAC_GE_EN11_Pos                     _UINT32_(11)                                         /* (XDMAC_GE) XDMAC Channel 11 Enable Bit Position */
#define XDMAC_GE_EN11_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN11_Pos)                 /* (XDMAC_GE) XDMAC Channel 11 Enable Bit Mask */
#define XDMAC_GE_EN11(value)                  (XDMAC_GE_EN11_Msk & (_UINT32_(value) << XDMAC_GE_EN11_Pos)) /* Assigment of value for EN11 in the XDMAC_GE register */
#define XDMAC_GE_EN12_Pos                     _UINT32_(12)                                         /* (XDMAC_GE) XDMAC Channel 12 Enable Bit Position */
#define XDMAC_GE_EN12_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN12_Pos)                 /* (XDMAC_GE) XDMAC Channel 12 Enable Bit Mask */
#define XDMAC_GE_EN12(value)                  (XDMAC_GE_EN12_Msk & (_UINT32_(value) << XDMAC_GE_EN12_Pos)) /* Assigment of value for EN12 in the XDMAC_GE register */
#define XDMAC_GE_EN13_Pos                     _UINT32_(13)                                         /* (XDMAC_GE) XDMAC Channel 13 Enable Bit Position */
#define XDMAC_GE_EN13_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN13_Pos)                 /* (XDMAC_GE) XDMAC Channel 13 Enable Bit Mask */
#define XDMAC_GE_EN13(value)                  (XDMAC_GE_EN13_Msk & (_UINT32_(value) << XDMAC_GE_EN13_Pos)) /* Assigment of value for EN13 in the XDMAC_GE register */
#define XDMAC_GE_EN14_Pos                     _UINT32_(14)                                         /* (XDMAC_GE) XDMAC Channel 14 Enable Bit Position */
#define XDMAC_GE_EN14_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN14_Pos)                 /* (XDMAC_GE) XDMAC Channel 14 Enable Bit Mask */
#define XDMAC_GE_EN14(value)                  (XDMAC_GE_EN14_Msk & (_UINT32_(value) << XDMAC_GE_EN14_Pos)) /* Assigment of value for EN14 in the XDMAC_GE register */
#define XDMAC_GE_EN15_Pos                     _UINT32_(15)                                         /* (XDMAC_GE) XDMAC Channel 15 Enable Bit Position */
#define XDMAC_GE_EN15_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN15_Pos)                 /* (XDMAC_GE) XDMAC Channel 15 Enable Bit Mask */
#define XDMAC_GE_EN15(value)                  (XDMAC_GE_EN15_Msk & (_UINT32_(value) << XDMAC_GE_EN15_Pos)) /* Assigment of value for EN15 in the XDMAC_GE register */
#define XDMAC_GE_EN16_Pos                     _UINT32_(16)                                         /* (XDMAC_GE) XDMAC Channel 16 Enable Bit Position */
#define XDMAC_GE_EN16_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN16_Pos)                 /* (XDMAC_GE) XDMAC Channel 16 Enable Bit Mask */
#define XDMAC_GE_EN16(value)                  (XDMAC_GE_EN16_Msk & (_UINT32_(value) << XDMAC_GE_EN16_Pos)) /* Assigment of value for EN16 in the XDMAC_GE register */
#define XDMAC_GE_EN17_Pos                     _UINT32_(17)                                         /* (XDMAC_GE) XDMAC Channel 17 Enable Bit Position */
#define XDMAC_GE_EN17_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN17_Pos)                 /* (XDMAC_GE) XDMAC Channel 17 Enable Bit Mask */
#define XDMAC_GE_EN17(value)                  (XDMAC_GE_EN17_Msk & (_UINT32_(value) << XDMAC_GE_EN17_Pos)) /* Assigment of value for EN17 in the XDMAC_GE register */
#define XDMAC_GE_EN18_Pos                     _UINT32_(18)                                         /* (XDMAC_GE) XDMAC Channel 18 Enable Bit Position */
#define XDMAC_GE_EN18_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN18_Pos)                 /* (XDMAC_GE) XDMAC Channel 18 Enable Bit Mask */
#define XDMAC_GE_EN18(value)                  (XDMAC_GE_EN18_Msk & (_UINT32_(value) << XDMAC_GE_EN18_Pos)) /* Assigment of value for EN18 in the XDMAC_GE register */
#define XDMAC_GE_EN19_Pos                     _UINT32_(19)                                         /* (XDMAC_GE) XDMAC Channel 19 Enable Bit Position */
#define XDMAC_GE_EN19_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN19_Pos)                 /* (XDMAC_GE) XDMAC Channel 19 Enable Bit Mask */
#define XDMAC_GE_EN19(value)                  (XDMAC_GE_EN19_Msk & (_UINT32_(value) << XDMAC_GE_EN19_Pos)) /* Assigment of value for EN19 in the XDMAC_GE register */
#define XDMAC_GE_EN20_Pos                     _UINT32_(20)                                         /* (XDMAC_GE) XDMAC Channel 20 Enable Bit Position */
#define XDMAC_GE_EN20_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN20_Pos)                 /* (XDMAC_GE) XDMAC Channel 20 Enable Bit Mask */
#define XDMAC_GE_EN20(value)                  (XDMAC_GE_EN20_Msk & (_UINT32_(value) << XDMAC_GE_EN20_Pos)) /* Assigment of value for EN20 in the XDMAC_GE register */
#define XDMAC_GE_EN21_Pos                     _UINT32_(21)                                         /* (XDMAC_GE) XDMAC Channel 21 Enable Bit Position */
#define XDMAC_GE_EN21_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN21_Pos)                 /* (XDMAC_GE) XDMAC Channel 21 Enable Bit Mask */
#define XDMAC_GE_EN21(value)                  (XDMAC_GE_EN21_Msk & (_UINT32_(value) << XDMAC_GE_EN21_Pos)) /* Assigment of value for EN21 in the XDMAC_GE register */
#define XDMAC_GE_EN22_Pos                     _UINT32_(22)                                         /* (XDMAC_GE) XDMAC Channel 22 Enable Bit Position */
#define XDMAC_GE_EN22_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN22_Pos)                 /* (XDMAC_GE) XDMAC Channel 22 Enable Bit Mask */
#define XDMAC_GE_EN22(value)                  (XDMAC_GE_EN22_Msk & (_UINT32_(value) << XDMAC_GE_EN22_Pos)) /* Assigment of value for EN22 in the XDMAC_GE register */
#define XDMAC_GE_EN23_Pos                     _UINT32_(23)                                         /* (XDMAC_GE) XDMAC Channel 23 Enable Bit Position */
#define XDMAC_GE_EN23_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN23_Pos)                 /* (XDMAC_GE) XDMAC Channel 23 Enable Bit Mask */
#define XDMAC_GE_EN23(value)                  (XDMAC_GE_EN23_Msk & (_UINT32_(value) << XDMAC_GE_EN23_Pos)) /* Assigment of value for EN23 in the XDMAC_GE register */
#define XDMAC_GE_EN24_Pos                     _UINT32_(24)                                         /* (XDMAC_GE) XDMAC Channel 24 Enable Bit Position */
#define XDMAC_GE_EN24_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN24_Pos)                 /* (XDMAC_GE) XDMAC Channel 24 Enable Bit Mask */
#define XDMAC_GE_EN24(value)                  (XDMAC_GE_EN24_Msk & (_UINT32_(value) << XDMAC_GE_EN24_Pos)) /* Assigment of value for EN24 in the XDMAC_GE register */
#define XDMAC_GE_EN25_Pos                     _UINT32_(25)                                         /* (XDMAC_GE) XDMAC Channel 25 Enable Bit Position */
#define XDMAC_GE_EN25_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN25_Pos)                 /* (XDMAC_GE) XDMAC Channel 25 Enable Bit Mask */
#define XDMAC_GE_EN25(value)                  (XDMAC_GE_EN25_Msk & (_UINT32_(value) << XDMAC_GE_EN25_Pos)) /* Assigment of value for EN25 in the XDMAC_GE register */
#define XDMAC_GE_EN26_Pos                     _UINT32_(26)                                         /* (XDMAC_GE) XDMAC Channel 26 Enable Bit Position */
#define XDMAC_GE_EN26_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN26_Pos)                 /* (XDMAC_GE) XDMAC Channel 26 Enable Bit Mask */
#define XDMAC_GE_EN26(value)                  (XDMAC_GE_EN26_Msk & (_UINT32_(value) << XDMAC_GE_EN26_Pos)) /* Assigment of value for EN26 in the XDMAC_GE register */
#define XDMAC_GE_EN27_Pos                     _UINT32_(27)                                         /* (XDMAC_GE) XDMAC Channel 27 Enable Bit Position */
#define XDMAC_GE_EN27_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN27_Pos)                 /* (XDMAC_GE) XDMAC Channel 27 Enable Bit Mask */
#define XDMAC_GE_EN27(value)                  (XDMAC_GE_EN27_Msk & (_UINT32_(value) << XDMAC_GE_EN27_Pos)) /* Assigment of value for EN27 in the XDMAC_GE register */
#define XDMAC_GE_EN28_Pos                     _UINT32_(28)                                         /* (XDMAC_GE) XDMAC Channel 28 Enable Bit Position */
#define XDMAC_GE_EN28_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN28_Pos)                 /* (XDMAC_GE) XDMAC Channel 28 Enable Bit Mask */
#define XDMAC_GE_EN28(value)                  (XDMAC_GE_EN28_Msk & (_UINT32_(value) << XDMAC_GE_EN28_Pos)) /* Assigment of value for EN28 in the XDMAC_GE register */
#define XDMAC_GE_EN29_Pos                     _UINT32_(29)                                         /* (XDMAC_GE) XDMAC Channel 29 Enable Bit Position */
#define XDMAC_GE_EN29_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN29_Pos)                 /* (XDMAC_GE) XDMAC Channel 29 Enable Bit Mask */
#define XDMAC_GE_EN29(value)                  (XDMAC_GE_EN29_Msk & (_UINT32_(value) << XDMAC_GE_EN29_Pos)) /* Assigment of value for EN29 in the XDMAC_GE register */
#define XDMAC_GE_EN30_Pos                     _UINT32_(30)                                         /* (XDMAC_GE) XDMAC Channel 30 Enable Bit Position */
#define XDMAC_GE_EN30_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN30_Pos)                 /* (XDMAC_GE) XDMAC Channel 30 Enable Bit Mask */
#define XDMAC_GE_EN30(value)                  (XDMAC_GE_EN30_Msk & (_UINT32_(value) << XDMAC_GE_EN30_Pos)) /* Assigment of value for EN30 in the XDMAC_GE register */
#define XDMAC_GE_EN31_Pos                     _UINT32_(31)                                         /* (XDMAC_GE) XDMAC Channel 31 Enable Bit Position */
#define XDMAC_GE_EN31_Msk                     (_UINT32_(0x1) << XDMAC_GE_EN31_Pos)                 /* (XDMAC_GE) XDMAC Channel 31 Enable Bit Mask */
#define XDMAC_GE_EN31(value)                  (XDMAC_GE_EN31_Msk & (_UINT32_(value) << XDMAC_GE_EN31_Pos)) /* Assigment of value for EN31 in the XDMAC_GE register */
#define XDMAC_GE_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (XDMAC_GE) Register Mask  */

