Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/xdmac.h
#define XDMAC_GE_EN_Pos                       _UINT32_(0)                                          /* (XDMAC_GE Position) XDMAC Channel 3x Enable Bit */
#define XDMAC_GE_EN_Msk                       (_UINT32_(0xFFFFFFFF) << XDMAC_GE_EN_Pos)            /* (XDMAC_GE Mask) EN */
#define XDMAC_GE_EN(value)                    (XDMAC_GE_EN_Msk & (_UINT32_(value) << XDMAC_GE_EN_Pos)) 

/* -------- XDMAC_GD : (XDMAC Offset: 0x20) ( /W 32) Global Channel Disable Register -------- */
#define XDMAC_GD_DI0_Pos                      _UINT32_(0)                                          /* (XDMAC_GD) XDMAC Channel 0 Disable Bit Position */
#define XDMAC_GD_DI0_Msk                      (_UINT32_(0x1) << XDMAC_GD_DI0_Pos)                  /* (XDMAC_GD) XDMAC Channel 0 Disable Bit Mask */
#define XDMAC_GD_DI0(value)                   (XDMAC_GD_DI0_Msk & (_UINT32_(value) << XDMAC_GD_DI0_Pos)) /* Assigment of value for DI0 in the XDMAC_GD register */
#define XDMAC_GD_DI1_Pos                      _UINT32_(1)                                          /* (XDMAC_GD) XDMAC Channel 1 Disable Bit Position */
#define XDMAC_GD_DI1_Msk                      (_UINT32_(0x1) << XDMAC_GD_DI1_Pos)                  /* (XDMAC_GD) XDMAC Channel 1 Disable Bit Mask */
#define XDMAC_GD_DI1(value)                   (XDMAC_GD_DI1_Msk & (_UINT32_(value) << XDMAC_GD_DI1_Pos)) /* Assigment of value for DI1 in the XDMAC_GD register */
#define XDMAC_GD_DI2_Pos                      _UINT32_(2)                                          /* (XDMAC_GD) XDMAC Channel 2 Disable Bit Position */
#define XDMAC_GD_DI2_Msk                      (_UINT32_(0x1) << XDMAC_GD_DI2_Pos)                  /* (XDMAC_GD) XDMAC Channel 2 Disable Bit Mask */
#define XDMAC_GD_DI2(value)                   (XDMAC_GD_DI2_Msk & (_UINT32_(value) << XDMAC_GD_DI2_Pos)) /* Assigment of value for DI2 in the XDMAC_GD register */
#define XDMAC_GD_DI3_Pos                      _UINT32_(3)                                          /* (XDMAC_GD) XDMAC Channel 3 Disable Bit Position */
#define XDMAC_GD_DI3_Msk                      (_UINT32_(0x1) << XDMAC_GD_DI3_Pos)                  /* (XDMAC_GD) XDMAC Channel 3 Disable Bit Mask */
#define XDMAC_GD_DI3(value)                   (XDMAC_GD_DI3_Msk & (_UINT32_(value) << XDMAC_GD_DI3_Pos)) /* Assigment of value for DI3 in the XDMAC_GD register */
#define XDMAC_GD_DI4_Pos                      _UINT32_(4)                                          /* (XDMAC_GD) XDMAC Channel 4 Disable Bit Position */
#define XDMAC_GD_DI4_Msk                      (_UINT32_(0x1) << XDMAC_GD_DI4_Pos)                  /* (XDMAC_GD) XDMAC Channel 4 Disable Bit Mask */
#define XDMAC_GD_DI4(value)                   (XDMAC_GD_DI4_Msk & (_UINT32_(value) << XDMAC_GD_DI4_Pos)) /* Assigment of value for DI4 in the XDMAC_GD register */
#define XDMAC_GD_DI5_Pos                      _UINT32_(5)                                          /* (XDMAC_GD) XDMAC Channel 5 Disable Bit Position */
#define XDMAC_GD_DI5_Msk                      (_UINT32_(0x1) << XDMAC_GD_DI5_Pos)                  /* (XDMAC_GD) XDMAC Channel 5 Disable Bit Mask */
#define XDMAC_GD_DI5(value)                   (XDMAC_GD_DI5_Msk & (_UINT32_(value) << XDMAC_GD_DI5_Pos)) /* Assigment of value for DI5 in the XDMAC_GD register */
#define XDMAC_GD_DI6_Pos                      _UINT32_(6)                                          /* (XDMAC_GD) XDMAC Channel 6 Disable Bit Position */
#define XDMAC_GD_DI6_Msk                      (_UINT32_(0x1) << XDMAC_GD_DI6_Pos)                  /* (XDMAC_GD) XDMAC Channel 6 Disable Bit Mask */
#define XDMAC_GD_DI6(value)                   (XDMAC_GD_DI6_Msk & (_UINT32_(value) << XDMAC_GD_DI6_Pos)) /* Assigment of value for DI6 in the XDMAC_GD register */
#define XDMAC_GD_DI7_Pos                      _UINT32_(7)                                          /* (XDMAC_GD) XDMAC Channel 7 Disable Bit Position */
#define XDMAC_GD_DI7_Msk                      (_UINT32_(0x1) << XDMAC_GD_DI7_Pos)                  /* (XDMAC_GD) XDMAC Channel 7 Disable Bit Mask */
#define XDMAC_GD_DI7(value)                   (XDMAC_GD_DI7_Msk & (_UINT32_(value) << XDMAC_GD_DI7_Pos)) /* Assigment of value for DI7 in the XDMAC_GD register */
#define XDMAC_GD_DI8_Pos                      _UINT32_(8)                                          /* (XDMAC_GD) XDMAC Channel 8 Disable Bit Position */
#define XDMAC_GD_DI8_Msk                      (_UINT32_(0x1) << XDMAC_GD_DI8_Pos)                  /* (XDMAC_GD) XDMAC Channel 8 Disable Bit Mask */
#define XDMAC_GD_DI8(value)                   (XDMAC_GD_DI8_Msk & (_UINT32_(value) << XDMAC_GD_DI8_Pos)) /* Assigment of value for DI8 in the XDMAC_GD register */
#define XDMAC_GD_DI9_Pos                      _UINT32_(9)                                          /* (XDMAC_GD) XDMAC Channel 9 Disable Bit Position */
#define XDMAC_GD_DI9_Msk                      (_UINT32_(0x1) << XDMAC_GD_DI9_Pos)                  /* (XDMAC_GD) XDMAC Channel 9 Disable Bit Mask */
#define XDMAC_GD_DI9(value)                   (XDMAC_GD_DI9_Msk & (_UINT32_(value) << XDMAC_GD_DI9_Pos)) /* Assigment of value for DI9 in the XDMAC_GD register */
#define XDMAC_GD_DI10_Pos                     _UINT32_(10)                                         /* (XDMAC_GD) XDMAC Channel 10 Disable Bit Position */
#define XDMAC_GD_DI10_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI10_Pos)                 /* (XDMAC_GD) XDMAC Channel 10 Disable Bit Mask */
#define XDMAC_GD_DI10(value)                  (XDMAC_GD_DI10_Msk & (_UINT32_(value) << XDMAC_GD_DI10_Pos)) /* Assigment of value for DI10 in the XDMAC_GD register */
#define XDMAC_GD_DI11_Pos                     _UINT32_(11)                                         /* (XDMAC_GD) XDMAC Channel 11 Disable Bit Position */
#define XDMAC_GD_DI11_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI11_Pos)                 /* (XDMAC_GD) XDMAC Channel 11 Disable Bit Mask */
#define XDMAC_GD_DI11(value)                  (XDMAC_GD_DI11_Msk & (_UINT32_(value) << XDMAC_GD_DI11_Pos)) /* Assigment of value for DI11 in the XDMAC_GD register */
#define XDMAC_GD_DI12_Pos                     _UINT32_(12)                                         /* (XDMAC_GD) XDMAC Channel 12 Disable Bit Position */
#define XDMAC_GD_DI12_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI12_Pos)                 /* (XDMAC_GD) XDMAC Channel 12 Disable Bit Mask */
#define XDMAC_GD_DI12(value)                  (XDMAC_GD_DI12_Msk & (_UINT32_(value) << XDMAC_GD_DI12_Pos)) /* Assigment of value for DI12 in the XDMAC_GD register */
#define XDMAC_GD_DI13_Pos                     _UINT32_(13)                                         /* (XDMAC_GD) XDMAC Channel 13 Disable Bit Position */
#define XDMAC_GD_DI13_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI13_Pos)                 /* (XDMAC_GD) XDMAC Channel 13 Disable Bit Mask */
#define XDMAC_GD_DI13(value)                  (XDMAC_GD_DI13_Msk & (_UINT32_(value) << XDMAC_GD_DI13_Pos)) /* Assigment of value for DI13 in the XDMAC_GD register */
#define XDMAC_GD_DI14_Pos                     _UINT32_(14)                                         /* (XDMAC_GD) XDMAC Channel 14 Disable Bit Position */
#define XDMAC_GD_DI14_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI14_Pos)                 /* (XDMAC_GD) XDMAC Channel 14 Disable Bit Mask */
#define XDMAC_GD_DI14(value)                  (XDMAC_GD_DI14_Msk & (_UINT32_(value) << XDMAC_GD_DI14_Pos)) /* Assigment of value for DI14 in the XDMAC_GD register */
#define XDMAC_GD_DI15_Pos                     _UINT32_(15)                                         /* (XDMAC_GD) XDMAC Channel 15 Disable Bit Position */
#define XDMAC_GD_DI15_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI15_Pos)                 /* (XDMAC_GD) XDMAC Channel 15 Disable Bit Mask */
#define XDMAC_GD_DI15(value)                  (XDMAC_GD_DI15_Msk & (_UINT32_(value) << XDMAC_GD_DI15_Pos)) /* Assigment of value for DI15 in the XDMAC_GD register */
#define XDMAC_GD_DI16_Pos                     _UINT32_(16)                                         /* (XDMAC_GD) XDMAC Channel 16 Disable Bit Position */
#define XDMAC_GD_DI16_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI16_Pos)                 /* (XDMAC_GD) XDMAC Channel 16 Disable Bit Mask */
#define XDMAC_GD_DI16(value)                  (XDMAC_GD_DI16_Msk & (_UINT32_(value) << XDMAC_GD_DI16_Pos)) /* Assigment of value for DI16 in the XDMAC_GD register */
#define XDMAC_GD_DI17_Pos                     _UINT32_(17)                                         /* (XDMAC_GD) XDMAC Channel 17 Disable Bit Position */
#define XDMAC_GD_DI17_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI17_Pos)                 /* (XDMAC_GD) XDMAC Channel 17 Disable Bit Mask */
#define XDMAC_GD_DI17(value)                  (XDMAC_GD_DI17_Msk & (_UINT32_(value) << XDMAC_GD_DI17_Pos)) /* Assigment of value for DI17 in the XDMAC_GD register */
#define XDMAC_GD_DI18_Pos                     _UINT32_(18)                                         /* (XDMAC_GD) XDMAC Channel 18 Disable Bit Position */
#define XDMAC_GD_DI18_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI18_Pos)                 /* (XDMAC_GD) XDMAC Channel 18 Disable Bit Mask */
#define XDMAC_GD_DI18(value)                  (XDMAC_GD_DI18_Msk & (_UINT32_(value) << XDMAC_GD_DI18_Pos)) /* Assigment of value for DI18 in the XDMAC_GD register */
#define XDMAC_GD_DI19_Pos                     _UINT32_(19)                                         /* (XDMAC_GD) XDMAC Channel 19 Disable Bit Position */
#define XDMAC_GD_DI19_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI19_Pos)                 /* (XDMAC_GD) XDMAC Channel 19 Disable Bit Mask */
#define XDMAC_GD_DI19(value)                  (XDMAC_GD_DI19_Msk & (_UINT32_(value) << XDMAC_GD_DI19_Pos)) /* Assigment of value for DI19 in the XDMAC_GD register */
#define XDMAC_GD_DI20_Pos                     _UINT32_(20)                                         /* (XDMAC_GD) XDMAC Channel 20 Disable Bit Position */
#define XDMAC_GD_DI20_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI20_Pos)                 /* (XDMAC_GD) XDMAC Channel 20 Disable Bit Mask */
#define XDMAC_GD_DI20(value)                  (XDMAC_GD_DI20_Msk & (_UINT32_(value) << XDMAC_GD_DI20_Pos)) /* Assigment of value for DI20 in the XDMAC_GD register */
#define XDMAC_GD_DI21_Pos                     _UINT32_(21)                                         /* (XDMAC_GD) XDMAC Channel 21 Disable Bit Position */
#define XDMAC_GD_DI21_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI21_Pos)                 /* (XDMAC_GD) XDMAC Channel 21 Disable Bit Mask */
#define XDMAC_GD_DI21(value)                  (XDMAC_GD_DI21_Msk & (_UINT32_(value) << XDMAC_GD_DI21_Pos)) /* Assigment of value for DI21 in the XDMAC_GD register */
#define XDMAC_GD_DI22_Pos                     _UINT32_(22)                                         /* (XDMAC_GD) XDMAC Channel 22 Disable Bit Position */
#define XDMAC_GD_DI22_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI22_Pos)                 /* (XDMAC_GD) XDMAC Channel 22 Disable Bit Mask */
#define XDMAC_GD_DI22(value)                  (XDMAC_GD_DI22_Msk & (_UINT32_(value) << XDMAC_GD_DI22_Pos)) /* Assigment of value for DI22 in the XDMAC_GD register */
#define XDMAC_GD_DI23_Pos                     _UINT32_(23)                                         /* (XDMAC_GD) XDMAC Channel 23 Disable Bit Position */
#define XDMAC_GD_DI23_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI23_Pos)                 /* (XDMAC_GD) XDMAC Channel 23 Disable Bit Mask */
#define XDMAC_GD_DI23(value)                  (XDMAC_GD_DI23_Msk & (_UINT32_(value) << XDMAC_GD_DI23_Pos)) /* Assigment of value for DI23 in the XDMAC_GD register */
#define XDMAC_GD_DI24_Pos                     _UINT32_(24)                                         /* (XDMAC_GD) XDMAC Channel 24 Disable Bit Position */
#define XDMAC_GD_DI24_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI24_Pos)                 /* (XDMAC_GD) XDMAC Channel 24 Disable Bit Mask */
#define XDMAC_GD_DI24(value)                  (XDMAC_GD_DI24_Msk & (_UINT32_(value) << XDMAC_GD_DI24_Pos)) /* Assigment of value for DI24 in the XDMAC_GD register */
#define XDMAC_GD_DI25_Pos                     _UINT32_(25)                                         /* (XDMAC_GD) XDMAC Channel 25 Disable Bit Position */
#define XDMAC_GD_DI25_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI25_Pos)                 /* (XDMAC_GD) XDMAC Channel 25 Disable Bit Mask */
#define XDMAC_GD_DI25(value)                  (XDMAC_GD_DI25_Msk & (_UINT32_(value) << XDMAC_GD_DI25_Pos)) /* Assigment of value for DI25 in the XDMAC_GD register */
#define XDMAC_GD_DI26_Pos                     _UINT32_(26)                                         /* (XDMAC_GD) XDMAC Channel 26 Disable Bit Position */
#define XDMAC_GD_DI26_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI26_Pos)                 /* (XDMAC_GD) XDMAC Channel 26 Disable Bit Mask */
#define XDMAC_GD_DI26(value)                  (XDMAC_GD_DI26_Msk & (_UINT32_(value) << XDMAC_GD_DI26_Pos)) /* Assigment of value for DI26 in the XDMAC_GD register */
#define XDMAC_GD_DI27_Pos                     _UINT32_(27)                                         /* (XDMAC_GD) XDMAC Channel 27 Disable Bit Position */
#define XDMAC_GD_DI27_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI27_Pos)                 /* (XDMAC_GD) XDMAC Channel 27 Disable Bit Mask */
#define XDMAC_GD_DI27(value)                  (XDMAC_GD_DI27_Msk & (_UINT32_(value) << XDMAC_GD_DI27_Pos)) /* Assigment of value for DI27 in the XDMAC_GD register */
#define XDMAC_GD_DI28_Pos                     _UINT32_(28)                                         /* (XDMAC_GD) XDMAC Channel 28 Disable Bit Position */
#define XDMAC_GD_DI28_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI28_Pos)                 /* (XDMAC_GD) XDMAC Channel 28 Disable Bit Mask */
#define XDMAC_GD_DI28(value)                  (XDMAC_GD_DI28_Msk & (_UINT32_(value) << XDMAC_GD_DI28_Pos)) /* Assigment of value for DI28 in the XDMAC_GD register */
#define XDMAC_GD_DI29_Pos                     _UINT32_(29)                                         /* (XDMAC_GD) XDMAC Channel 29 Disable Bit Position */
#define XDMAC_GD_DI29_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI29_Pos)                 /* (XDMAC_GD) XDMAC Channel 29 Disable Bit Mask */
#define XDMAC_GD_DI29(value)                  (XDMAC_GD_DI29_Msk & (_UINT32_(value) << XDMAC_GD_DI29_Pos)) /* Assigment of value for DI29 in the XDMAC_GD register */
#define XDMAC_GD_DI30_Pos                     _UINT32_(30)                                         /* (XDMAC_GD) XDMAC Channel 30 Disable Bit Position */
#define XDMAC_GD_DI30_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI30_Pos)                 /* (XDMAC_GD) XDMAC Channel 30 Disable Bit Mask */
#define XDMAC_GD_DI30(value)                  (XDMAC_GD_DI30_Msk & (_UINT32_(value) << XDMAC_GD_DI30_Pos)) /* Assigment of value for DI30 in the XDMAC_GD register */
#define XDMAC_GD_DI31_Pos                     _UINT32_(31)                                         /* (XDMAC_GD) XDMAC Channel 31 Disable Bit Position */
#define XDMAC_GD_DI31_Msk                     (_UINT32_(0x1) << XDMAC_GD_DI31_Pos)                 /* (XDMAC_GD) XDMAC Channel 31 Disable Bit Mask */
#define XDMAC_GD_DI31(value)                  (XDMAC_GD_DI31_Msk & (_UINT32_(value) << XDMAC_GD_DI31_Pos)) /* Assigment of value for DI31 in the XDMAC_GD register */
#define XDMAC_GD_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (XDMAC_GD) Register Mask  */

#define XDMAC_GD_DI_Pos                       _UINT32_(0)                                          /* (XDMAC_GD Position) XDMAC Channel 3x Disable Bit */
#define XDMAC_GD_DI_Msk                       (_UINT32_(0xFFFFFFFF) << XDMAC_GD_DI_Pos)            /* (XDMAC_GD Mask) DI */
#define XDMAC_GD_DI(value)                    (XDMAC_GD_DI_Msk & (_UINT32_(value) << XDMAC_GD_DI_Pos)) 

