Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/xdmac.h
/* -------- XDMAC_GS : (XDMAC Offset: 0x24) ( R/ 32) Global Channel Status Register -------- */
#define XDMAC_GS_ST0_Pos                      _UINT32_(0)                                          /* (XDMAC_GS) XDMAC Channel 0 Status Bit Position */
#define XDMAC_GS_ST0_Msk                      (_UINT32_(0x1) << XDMAC_GS_ST0_Pos)                  /* (XDMAC_GS) XDMAC Channel 0 Status Bit Mask */
#define XDMAC_GS_ST0(value)                   (XDMAC_GS_ST0_Msk & (_UINT32_(value) << XDMAC_GS_ST0_Pos)) /* Assigment of value for ST0 in the XDMAC_GS register */
#define XDMAC_GS_ST1_Pos                      _UINT32_(1)                                          /* (XDMAC_GS) XDMAC Channel 1 Status Bit Position */
#define XDMAC_GS_ST1_Msk                      (_UINT32_(0x1) << XDMAC_GS_ST1_Pos)                  /* (XDMAC_GS) XDMAC Channel 1 Status Bit Mask */
#define XDMAC_GS_ST1(value)                   (XDMAC_GS_ST1_Msk & (_UINT32_(value) << XDMAC_GS_ST1_Pos)) /* Assigment of value for ST1 in the XDMAC_GS register */
#define XDMAC_GS_ST2_Pos                      _UINT32_(2)                                          /* (XDMAC_GS) XDMAC Channel 2 Status Bit Position */
#define XDMAC_GS_ST2_Msk                      (_UINT32_(0x1) << XDMAC_GS_ST2_Pos)                  /* (XDMAC_GS) XDMAC Channel 2 Status Bit Mask */
#define XDMAC_GS_ST2(value)                   (XDMAC_GS_ST2_Msk & (_UINT32_(value) << XDMAC_GS_ST2_Pos)) /* Assigment of value for ST2 in the XDMAC_GS register */
#define XDMAC_GS_ST3_Pos                      _UINT32_(3)                                          /* (XDMAC_GS) XDMAC Channel 3 Status Bit Position */
#define XDMAC_GS_ST3_Msk                      (_UINT32_(0x1) << XDMAC_GS_ST3_Pos)                  /* (XDMAC_GS) XDMAC Channel 3 Status Bit Mask */
#define XDMAC_GS_ST3(value)                   (XDMAC_GS_ST3_Msk & (_UINT32_(value) << XDMAC_GS_ST3_Pos)) /* Assigment of value for ST3 in the XDMAC_GS register */
#define XDMAC_GS_ST4_Pos                      _UINT32_(4)                                          /* (XDMAC_GS) XDMAC Channel 4 Status Bit Position */
#define XDMAC_GS_ST4_Msk                      (_UINT32_(0x1) << XDMAC_GS_ST4_Pos)                  /* (XDMAC_GS) XDMAC Channel 4 Status Bit Mask */
#define XDMAC_GS_ST4(value)                   (XDMAC_GS_ST4_Msk & (_UINT32_(value) << XDMAC_GS_ST4_Pos)) /* Assigment of value for ST4 in the XDMAC_GS register */
#define XDMAC_GS_ST5_Pos                      _UINT32_(5)                                          /* (XDMAC_GS) XDMAC Channel 5 Status Bit Position */
#define XDMAC_GS_ST5_Msk                      (_UINT32_(0x1) << XDMAC_GS_ST5_Pos)                  /* (XDMAC_GS) XDMAC Channel 5 Status Bit Mask */
#define XDMAC_GS_ST5(value)                   (XDMAC_GS_ST5_Msk & (_UINT32_(value) << XDMAC_GS_ST5_Pos)) /* Assigment of value for ST5 in the XDMAC_GS register */
#define XDMAC_GS_ST6_Pos                      _UINT32_(6)                                          /* (XDMAC_GS) XDMAC Channel 6 Status Bit Position */
#define XDMAC_GS_ST6_Msk                      (_UINT32_(0x1) << XDMAC_GS_ST6_Pos)                  /* (XDMAC_GS) XDMAC Channel 6 Status Bit Mask */
#define XDMAC_GS_ST6(value)                   (XDMAC_GS_ST6_Msk & (_UINT32_(value) << XDMAC_GS_ST6_Pos)) /* Assigment of value for ST6 in the XDMAC_GS register */
#define XDMAC_GS_ST7_Pos                      _UINT32_(7)                                          /* (XDMAC_GS) XDMAC Channel 7 Status Bit Position */
#define XDMAC_GS_ST7_Msk                      (_UINT32_(0x1) << XDMAC_GS_ST7_Pos)                  /* (XDMAC_GS) XDMAC Channel 7 Status Bit Mask */
#define XDMAC_GS_ST7(value)                   (XDMAC_GS_ST7_Msk & (_UINT32_(value) << XDMAC_GS_ST7_Pos)) /* Assigment of value for ST7 in the XDMAC_GS register */
#define XDMAC_GS_ST8_Pos                      _UINT32_(8)                                          /* (XDMAC_GS) XDMAC Channel 8 Status Bit Position */
#define XDMAC_GS_ST8_Msk                      (_UINT32_(0x1) << XDMAC_GS_ST8_Pos)                  /* (XDMAC_GS) XDMAC Channel 8 Status Bit Mask */
#define XDMAC_GS_ST8(value)                   (XDMAC_GS_ST8_Msk & (_UINT32_(value) << XDMAC_GS_ST8_Pos)) /* Assigment of value for ST8 in the XDMAC_GS register */
#define XDMAC_GS_ST9_Pos                      _UINT32_(9)                                          /* (XDMAC_GS) XDMAC Channel 9 Status Bit Position */
#define XDMAC_GS_ST9_Msk                      (_UINT32_(0x1) << XDMAC_GS_ST9_Pos)                  /* (XDMAC_GS) XDMAC Channel 9 Status Bit Mask */
#define XDMAC_GS_ST9(value)                   (XDMAC_GS_ST9_Msk & (_UINT32_(value) << XDMAC_GS_ST9_Pos)) /* Assigment of value for ST9 in the XDMAC_GS register */
#define XDMAC_GS_ST10_Pos                     _UINT32_(10)                                         /* (XDMAC_GS) XDMAC Channel 10 Status Bit Position */
#define XDMAC_GS_ST10_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST10_Pos)                 /* (XDMAC_GS) XDMAC Channel 10 Status Bit Mask */
#define XDMAC_GS_ST10(value)                  (XDMAC_GS_ST10_Msk & (_UINT32_(value) << XDMAC_GS_ST10_Pos)) /* Assigment of value for ST10 in the XDMAC_GS register */
#define XDMAC_GS_ST11_Pos                     _UINT32_(11)                                         /* (XDMAC_GS) XDMAC Channel 11 Status Bit Position */
#define XDMAC_GS_ST11_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST11_Pos)                 /* (XDMAC_GS) XDMAC Channel 11 Status Bit Mask */
#define XDMAC_GS_ST11(value)                  (XDMAC_GS_ST11_Msk & (_UINT32_(value) << XDMAC_GS_ST11_Pos)) /* Assigment of value for ST11 in the XDMAC_GS register */
#define XDMAC_GS_ST12_Pos                     _UINT32_(12)                                         /* (XDMAC_GS) XDMAC Channel 12 Status Bit Position */
#define XDMAC_GS_ST12_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST12_Pos)                 /* (XDMAC_GS) XDMAC Channel 12 Status Bit Mask */
#define XDMAC_GS_ST12(value)                  (XDMAC_GS_ST12_Msk & (_UINT32_(value) << XDMAC_GS_ST12_Pos)) /* Assigment of value for ST12 in the XDMAC_GS register */
#define XDMAC_GS_ST13_Pos                     _UINT32_(13)                                         /* (XDMAC_GS) XDMAC Channel 13 Status Bit Position */
#define XDMAC_GS_ST13_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST13_Pos)                 /* (XDMAC_GS) XDMAC Channel 13 Status Bit Mask */
#define XDMAC_GS_ST13(value)                  (XDMAC_GS_ST13_Msk & (_UINT32_(value) << XDMAC_GS_ST13_Pos)) /* Assigment of value for ST13 in the XDMAC_GS register */
#define XDMAC_GS_ST14_Pos                     _UINT32_(14)                                         /* (XDMAC_GS) XDMAC Channel 14 Status Bit Position */
#define XDMAC_GS_ST14_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST14_Pos)                 /* (XDMAC_GS) XDMAC Channel 14 Status Bit Mask */
#define XDMAC_GS_ST14(value)                  (XDMAC_GS_ST14_Msk & (_UINT32_(value) << XDMAC_GS_ST14_Pos)) /* Assigment of value for ST14 in the XDMAC_GS register */
#define XDMAC_GS_ST15_Pos                     _UINT32_(15)                                         /* (XDMAC_GS) XDMAC Channel 15 Status Bit Position */
#define XDMAC_GS_ST15_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST15_Pos)                 /* (XDMAC_GS) XDMAC Channel 15 Status Bit Mask */
#define XDMAC_GS_ST15(value)                  (XDMAC_GS_ST15_Msk & (_UINT32_(value) << XDMAC_GS_ST15_Pos)) /* Assigment of value for ST15 in the XDMAC_GS register */
#define XDMAC_GS_ST16_Pos                     _UINT32_(16)                                         /* (XDMAC_GS) XDMAC Channel 16 Status Bit Position */
#define XDMAC_GS_ST16_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST16_Pos)                 /* (XDMAC_GS) XDMAC Channel 16 Status Bit Mask */
#define XDMAC_GS_ST16(value)                  (XDMAC_GS_ST16_Msk & (_UINT32_(value) << XDMAC_GS_ST16_Pos)) /* Assigment of value for ST16 in the XDMAC_GS register */
#define XDMAC_GS_ST17_Pos                     _UINT32_(17)                                         /* (XDMAC_GS) XDMAC Channel 17 Status Bit Position */
#define XDMAC_GS_ST17_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST17_Pos)                 /* (XDMAC_GS) XDMAC Channel 17 Status Bit Mask */
#define XDMAC_GS_ST17(value)                  (XDMAC_GS_ST17_Msk & (_UINT32_(value) << XDMAC_GS_ST17_Pos)) /* Assigment of value for ST17 in the XDMAC_GS register */
#define XDMAC_GS_ST18_Pos                     _UINT32_(18)                                         /* (XDMAC_GS) XDMAC Channel 18 Status Bit Position */
#define XDMAC_GS_ST18_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST18_Pos)                 /* (XDMAC_GS) XDMAC Channel 18 Status Bit Mask */
#define XDMAC_GS_ST18(value)                  (XDMAC_GS_ST18_Msk & (_UINT32_(value) << XDMAC_GS_ST18_Pos)) /* Assigment of value for ST18 in the XDMAC_GS register */
#define XDMAC_GS_ST19_Pos                     _UINT32_(19)                                         /* (XDMAC_GS) XDMAC Channel 19 Status Bit Position */
#define XDMAC_GS_ST19_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST19_Pos)                 /* (XDMAC_GS) XDMAC Channel 19 Status Bit Mask */
#define XDMAC_GS_ST19(value)                  (XDMAC_GS_ST19_Msk & (_UINT32_(value) << XDMAC_GS_ST19_Pos)) /* Assigment of value for ST19 in the XDMAC_GS register */
#define XDMAC_GS_ST20_Pos                     _UINT32_(20)                                         /* (XDMAC_GS) XDMAC Channel 20 Status Bit Position */
#define XDMAC_GS_ST20_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST20_Pos)                 /* (XDMAC_GS) XDMAC Channel 20 Status Bit Mask */
#define XDMAC_GS_ST20(value)                  (XDMAC_GS_ST20_Msk & (_UINT32_(value) << XDMAC_GS_ST20_Pos)) /* Assigment of value for ST20 in the XDMAC_GS register */
#define XDMAC_GS_ST21_Pos                     _UINT32_(21)                                         /* (XDMAC_GS) XDMAC Channel 21 Status Bit Position */
#define XDMAC_GS_ST21_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST21_Pos)                 /* (XDMAC_GS) XDMAC Channel 21 Status Bit Mask */
#define XDMAC_GS_ST21(value)                  (XDMAC_GS_ST21_Msk & (_UINT32_(value) << XDMAC_GS_ST21_Pos)) /* Assigment of value for ST21 in the XDMAC_GS register */
#define XDMAC_GS_ST22_Pos                     _UINT32_(22)                                         /* (XDMAC_GS) XDMAC Channel 22 Status Bit Position */
#define XDMAC_GS_ST22_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST22_Pos)                 /* (XDMAC_GS) XDMAC Channel 22 Status Bit Mask */
#define XDMAC_GS_ST22(value)                  (XDMAC_GS_ST22_Msk & (_UINT32_(value) << XDMAC_GS_ST22_Pos)) /* Assigment of value for ST22 in the XDMAC_GS register */
#define XDMAC_GS_ST23_Pos                     _UINT32_(23)                                         /* (XDMAC_GS) XDMAC Channel 23 Status Bit Position */
#define XDMAC_GS_ST23_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST23_Pos)                 /* (XDMAC_GS) XDMAC Channel 23 Status Bit Mask */
#define XDMAC_GS_ST23(value)                  (XDMAC_GS_ST23_Msk & (_UINT32_(value) << XDMAC_GS_ST23_Pos)) /* Assigment of value for ST23 in the XDMAC_GS register */
#define XDMAC_GS_ST24_Pos                     _UINT32_(24)                                         /* (XDMAC_GS) XDMAC Channel 24 Status Bit Position */
#define XDMAC_GS_ST24_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST24_Pos)                 /* (XDMAC_GS) XDMAC Channel 24 Status Bit Mask */
#define XDMAC_GS_ST24(value)                  (XDMAC_GS_ST24_Msk & (_UINT32_(value) << XDMAC_GS_ST24_Pos)) /* Assigment of value for ST24 in the XDMAC_GS register */
#define XDMAC_GS_ST25_Pos                     _UINT32_(25)                                         /* (XDMAC_GS) XDMAC Channel 25 Status Bit Position */
#define XDMAC_GS_ST25_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST25_Pos)                 /* (XDMAC_GS) XDMAC Channel 25 Status Bit Mask */
#define XDMAC_GS_ST25(value)                  (XDMAC_GS_ST25_Msk & (_UINT32_(value) << XDMAC_GS_ST25_Pos)) /* Assigment of value for ST25 in the XDMAC_GS register */
#define XDMAC_GS_ST26_Pos                     _UINT32_(26)                                         /* (XDMAC_GS) XDMAC Channel 26 Status Bit Position */
#define XDMAC_GS_ST26_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST26_Pos)                 /* (XDMAC_GS) XDMAC Channel 26 Status Bit Mask */
#define XDMAC_GS_ST26(value)                  (XDMAC_GS_ST26_Msk & (_UINT32_(value) << XDMAC_GS_ST26_Pos)) /* Assigment of value for ST26 in the XDMAC_GS register */
#define XDMAC_GS_ST27_Pos                     _UINT32_(27)                                         /* (XDMAC_GS) XDMAC Channel 27 Status Bit Position */
#define XDMAC_GS_ST27_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST27_Pos)                 /* (XDMAC_GS) XDMAC Channel 27 Status Bit Mask */
#define XDMAC_GS_ST27(value)                  (XDMAC_GS_ST27_Msk & (_UINT32_(value) << XDMAC_GS_ST27_Pos)) /* Assigment of value for ST27 in the XDMAC_GS register */
#define XDMAC_GS_ST28_Pos                     _UINT32_(28)                                         /* (XDMAC_GS) XDMAC Channel 28 Status Bit Position */
#define XDMAC_GS_ST28_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST28_Pos)                 /* (XDMAC_GS) XDMAC Channel 28 Status Bit Mask */
#define XDMAC_GS_ST28(value)                  (XDMAC_GS_ST28_Msk & (_UINT32_(value) << XDMAC_GS_ST28_Pos)) /* Assigment of value for ST28 in the XDMAC_GS register */
#define XDMAC_GS_ST29_Pos                     _UINT32_(29)                                         /* (XDMAC_GS) XDMAC Channel 29 Status Bit Position */
#define XDMAC_GS_ST29_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST29_Pos)                 /* (XDMAC_GS) XDMAC Channel 29 Status Bit Mask */
#define XDMAC_GS_ST29(value)                  (XDMAC_GS_ST29_Msk & (_UINT32_(value) << XDMAC_GS_ST29_Pos)) /* Assigment of value for ST29 in the XDMAC_GS register */
#define XDMAC_GS_ST30_Pos                     _UINT32_(30)                                         /* (XDMAC_GS) XDMAC Channel 30 Status Bit Position */
#define XDMAC_GS_ST30_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST30_Pos)                 /* (XDMAC_GS) XDMAC Channel 30 Status Bit Mask */
#define XDMAC_GS_ST30(value)                  (XDMAC_GS_ST30_Msk & (_UINT32_(value) << XDMAC_GS_ST30_Pos)) /* Assigment of value for ST30 in the XDMAC_GS register */
#define XDMAC_GS_ST31_Pos                     _UINT32_(31)                                         /* (XDMAC_GS) XDMAC Channel 31 Status Bit Position */
#define XDMAC_GS_ST31_Msk                     (_UINT32_(0x1) << XDMAC_GS_ST31_Pos)                 /* (XDMAC_GS) XDMAC Channel 31 Status Bit Mask */
#define XDMAC_GS_ST31(value)                  (XDMAC_GS_ST31_Msk & (_UINT32_(value) << XDMAC_GS_ST31_Pos)) /* Assigment of value for ST31 in the XDMAC_GS register */
#define XDMAC_GS_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (XDMAC_GS) Register Mask  */

