Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/xdmac.h
#define XDMAC_GS_ST_Pos                       _UINT32_(0)                                          /* (XDMAC_GS Position) XDMAC Channel 3x Status Bit */
#define XDMAC_GS_ST_Msk                       (_UINT32_(0xFFFFFFFF) << XDMAC_GS_ST_Pos)            /* (XDMAC_GS Mask) ST */
#define XDMAC_GS_ST(value)                    (XDMAC_GS_ST_Msk & (_UINT32_(value) << XDMAC_GS_ST_Pos)) 

/* -------- XDMAC_GRS : (XDMAC Offset: 0x28) (R/W 32) Global Channel Read Suspend Register -------- */
#define XDMAC_GRS_RS0_Pos                     _UINT32_(0)                                          /* (XDMAC_GRS) XDMAC Channel 0 Read Suspend Bit Position */
#define XDMAC_GRS_RS0_Msk                     (_UINT32_(0x1) << XDMAC_GRS_RS0_Pos)                 /* (XDMAC_GRS) XDMAC Channel 0 Read Suspend Bit Mask */
#define XDMAC_GRS_RS0(value)                  (XDMAC_GRS_RS0_Msk & (_UINT32_(value) << XDMAC_GRS_RS0_Pos)) /* Assigment of value for RS0 in the XDMAC_GRS register */
#define XDMAC_GRS_RS1_Pos                     _UINT32_(1)                                          /* (XDMAC_GRS) XDMAC Channel 1 Read Suspend Bit Position */
#define XDMAC_GRS_RS1_Msk                     (_UINT32_(0x1) << XDMAC_GRS_RS1_Pos)                 /* (XDMAC_GRS) XDMAC Channel 1 Read Suspend Bit Mask */
#define XDMAC_GRS_RS1(value)                  (XDMAC_GRS_RS1_Msk & (_UINT32_(value) << XDMAC_GRS_RS1_Pos)) /* Assigment of value for RS1 in the XDMAC_GRS register */
#define XDMAC_GRS_RS2_Pos                     _UINT32_(2)                                          /* (XDMAC_GRS) XDMAC Channel 2 Read Suspend Bit Position */
#define XDMAC_GRS_RS2_Msk                     (_UINT32_(0x1) << XDMAC_GRS_RS2_Pos)                 /* (XDMAC_GRS) XDMAC Channel 2 Read Suspend Bit Mask */
#define XDMAC_GRS_RS2(value)                  (XDMAC_GRS_RS2_Msk & (_UINT32_(value) << XDMAC_GRS_RS2_Pos)) /* Assigment of value for RS2 in the XDMAC_GRS register */
#define XDMAC_GRS_RS3_Pos                     _UINT32_(3)                                          /* (XDMAC_GRS) XDMAC Channel 3 Read Suspend Bit Position */
#define XDMAC_GRS_RS3_Msk                     (_UINT32_(0x1) << XDMAC_GRS_RS3_Pos)                 /* (XDMAC_GRS) XDMAC Channel 3 Read Suspend Bit Mask */
#define XDMAC_GRS_RS3(value)                  (XDMAC_GRS_RS3_Msk & (_UINT32_(value) << XDMAC_GRS_RS3_Pos)) /* Assigment of value for RS3 in the XDMAC_GRS register */
#define XDMAC_GRS_RS4_Pos                     _UINT32_(4)                                          /* (XDMAC_GRS) XDMAC Channel 4 Read Suspend Bit Position */
#define XDMAC_GRS_RS4_Msk                     (_UINT32_(0x1) << XDMAC_GRS_RS4_Pos)                 /* (XDMAC_GRS) XDMAC Channel 4 Read Suspend Bit Mask */
#define XDMAC_GRS_RS4(value)                  (XDMAC_GRS_RS4_Msk & (_UINT32_(value) << XDMAC_GRS_RS4_Pos)) /* Assigment of value for RS4 in the XDMAC_GRS register */
#define XDMAC_GRS_RS5_Pos                     _UINT32_(5)                                          /* (XDMAC_GRS) XDMAC Channel 5 Read Suspend Bit Position */
#define XDMAC_GRS_RS5_Msk                     (_UINT32_(0x1) << XDMAC_GRS_RS5_Pos)                 /* (XDMAC_GRS) XDMAC Channel 5 Read Suspend Bit Mask */
#define XDMAC_GRS_RS5(value)                  (XDMAC_GRS_RS5_Msk & (_UINT32_(value) << XDMAC_GRS_RS5_Pos)) /* Assigment of value for RS5 in the XDMAC_GRS register */
#define XDMAC_GRS_RS6_Pos                     _UINT32_(6)                                          /* (XDMAC_GRS) XDMAC Channel 6 Read Suspend Bit Position */
#define XDMAC_GRS_RS6_Msk                     (_UINT32_(0x1) << XDMAC_GRS_RS6_Pos)                 /* (XDMAC_GRS) XDMAC Channel 6 Read Suspend Bit Mask */
#define XDMAC_GRS_RS6(value)                  (XDMAC_GRS_RS6_Msk & (_UINT32_(value) << XDMAC_GRS_RS6_Pos)) /* Assigment of value for RS6 in the XDMAC_GRS register */
#define XDMAC_GRS_RS7_Pos                     _UINT32_(7)                                          /* (XDMAC_GRS) XDMAC Channel 7 Read Suspend Bit Position */
#define XDMAC_GRS_RS7_Msk                     (_UINT32_(0x1) << XDMAC_GRS_RS7_Pos)                 /* (XDMAC_GRS) XDMAC Channel 7 Read Suspend Bit Mask */
#define XDMAC_GRS_RS7(value)                  (XDMAC_GRS_RS7_Msk & (_UINT32_(value) << XDMAC_GRS_RS7_Pos)) /* Assigment of value for RS7 in the XDMAC_GRS register */
#define XDMAC_GRS_RS8_Pos                     _UINT32_(8)                                          /* (XDMAC_GRS) XDMAC Channel 8 Read Suspend Bit Position */
#define XDMAC_GRS_RS8_Msk                     (_UINT32_(0x1) << XDMAC_GRS_RS8_Pos)                 /* (XDMAC_GRS) XDMAC Channel 8 Read Suspend Bit Mask */
#define XDMAC_GRS_RS8(value)                  (XDMAC_GRS_RS8_Msk & (_UINT32_(value) << XDMAC_GRS_RS8_Pos)) /* Assigment of value for RS8 in the XDMAC_GRS register */
#define XDMAC_GRS_RS9_Pos                     _UINT32_(9)                                          /* (XDMAC_GRS) XDMAC Channel 9 Read Suspend Bit Position */
#define XDMAC_GRS_RS9_Msk                     (_UINT32_(0x1) << XDMAC_GRS_RS9_Pos)                 /* (XDMAC_GRS) XDMAC Channel 9 Read Suspend Bit Mask */
#define XDMAC_GRS_RS9(value)                  (XDMAC_GRS_RS9_Msk & (_UINT32_(value) << XDMAC_GRS_RS9_Pos)) /* Assigment of value for RS9 in the XDMAC_GRS register */
#define XDMAC_GRS_RS10_Pos                    _UINT32_(10)                                         /* (XDMAC_GRS) XDMAC Channel 10 Read Suspend Bit Position */
#define XDMAC_GRS_RS10_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS10_Pos)                /* (XDMAC_GRS) XDMAC Channel 10 Read Suspend Bit Mask */
#define XDMAC_GRS_RS10(value)                 (XDMAC_GRS_RS10_Msk & (_UINT32_(value) << XDMAC_GRS_RS10_Pos)) /* Assigment of value for RS10 in the XDMAC_GRS register */
#define XDMAC_GRS_RS11_Pos                    _UINT32_(11)                                         /* (XDMAC_GRS) XDMAC Channel 11 Read Suspend Bit Position */
#define XDMAC_GRS_RS11_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS11_Pos)                /* (XDMAC_GRS) XDMAC Channel 11 Read Suspend Bit Mask */
#define XDMAC_GRS_RS11(value)                 (XDMAC_GRS_RS11_Msk & (_UINT32_(value) << XDMAC_GRS_RS11_Pos)) /* Assigment of value for RS11 in the XDMAC_GRS register */
#define XDMAC_GRS_RS12_Pos                    _UINT32_(12)                                         /* (XDMAC_GRS) XDMAC Channel 12 Read Suspend Bit Position */
#define XDMAC_GRS_RS12_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS12_Pos)                /* (XDMAC_GRS) XDMAC Channel 12 Read Suspend Bit Mask */
#define XDMAC_GRS_RS12(value)                 (XDMAC_GRS_RS12_Msk & (_UINT32_(value) << XDMAC_GRS_RS12_Pos)) /* Assigment of value for RS12 in the XDMAC_GRS register */
#define XDMAC_GRS_RS13_Pos                    _UINT32_(13)                                         /* (XDMAC_GRS) XDMAC Channel 13 Read Suspend Bit Position */
#define XDMAC_GRS_RS13_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS13_Pos)                /* (XDMAC_GRS) XDMAC Channel 13 Read Suspend Bit Mask */
#define XDMAC_GRS_RS13(value)                 (XDMAC_GRS_RS13_Msk & (_UINT32_(value) << XDMAC_GRS_RS13_Pos)) /* Assigment of value for RS13 in the XDMAC_GRS register */
#define XDMAC_GRS_RS14_Pos                    _UINT32_(14)                                         /* (XDMAC_GRS) XDMAC Channel 14 Read Suspend Bit Position */
#define XDMAC_GRS_RS14_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS14_Pos)                /* (XDMAC_GRS) XDMAC Channel 14 Read Suspend Bit Mask */
#define XDMAC_GRS_RS14(value)                 (XDMAC_GRS_RS14_Msk & (_UINT32_(value) << XDMAC_GRS_RS14_Pos)) /* Assigment of value for RS14 in the XDMAC_GRS register */
#define XDMAC_GRS_RS15_Pos                    _UINT32_(15)                                         /* (XDMAC_GRS) XDMAC Channel 15 Read Suspend Bit Position */
#define XDMAC_GRS_RS15_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS15_Pos)                /* (XDMAC_GRS) XDMAC Channel 15 Read Suspend Bit Mask */
#define XDMAC_GRS_RS15(value)                 (XDMAC_GRS_RS15_Msk & (_UINT32_(value) << XDMAC_GRS_RS15_Pos)) /* Assigment of value for RS15 in the XDMAC_GRS register */
#define XDMAC_GRS_RS16_Pos                    _UINT32_(16)                                         /* (XDMAC_GRS) XDMAC Channel 16 Read Suspend Bit Position */
#define XDMAC_GRS_RS16_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS16_Pos)                /* (XDMAC_GRS) XDMAC Channel 16 Read Suspend Bit Mask */
#define XDMAC_GRS_RS16(value)                 (XDMAC_GRS_RS16_Msk & (_UINT32_(value) << XDMAC_GRS_RS16_Pos)) /* Assigment of value for RS16 in the XDMAC_GRS register */
#define XDMAC_GRS_RS17_Pos                    _UINT32_(17)                                         /* (XDMAC_GRS) XDMAC Channel 17 Read Suspend Bit Position */
#define XDMAC_GRS_RS17_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS17_Pos)                /* (XDMAC_GRS) XDMAC Channel 17 Read Suspend Bit Mask */
#define XDMAC_GRS_RS17(value)                 (XDMAC_GRS_RS17_Msk & (_UINT32_(value) << XDMAC_GRS_RS17_Pos)) /* Assigment of value for RS17 in the XDMAC_GRS register */
#define XDMAC_GRS_RS18_Pos                    _UINT32_(18)                                         /* (XDMAC_GRS) XDMAC Channel 18 Read Suspend Bit Position */
#define XDMAC_GRS_RS18_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS18_Pos)                /* (XDMAC_GRS) XDMAC Channel 18 Read Suspend Bit Mask */
#define XDMAC_GRS_RS18(value)                 (XDMAC_GRS_RS18_Msk & (_UINT32_(value) << XDMAC_GRS_RS18_Pos)) /* Assigment of value for RS18 in the XDMAC_GRS register */
#define XDMAC_GRS_RS19_Pos                    _UINT32_(19)                                         /* (XDMAC_GRS) XDMAC Channel 19 Read Suspend Bit Position */
#define XDMAC_GRS_RS19_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS19_Pos)                /* (XDMAC_GRS) XDMAC Channel 19 Read Suspend Bit Mask */
#define XDMAC_GRS_RS19(value)                 (XDMAC_GRS_RS19_Msk & (_UINT32_(value) << XDMAC_GRS_RS19_Pos)) /* Assigment of value for RS19 in the XDMAC_GRS register */
#define XDMAC_GRS_RS20_Pos                    _UINT32_(20)                                         /* (XDMAC_GRS) XDMAC Channel 20 Read Suspend Bit Position */
#define XDMAC_GRS_RS20_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS20_Pos)                /* (XDMAC_GRS) XDMAC Channel 20 Read Suspend Bit Mask */
#define XDMAC_GRS_RS20(value)                 (XDMAC_GRS_RS20_Msk & (_UINT32_(value) << XDMAC_GRS_RS20_Pos)) /* Assigment of value for RS20 in the XDMAC_GRS register */
#define XDMAC_GRS_RS21_Pos                    _UINT32_(21)                                         /* (XDMAC_GRS) XDMAC Channel 21 Read Suspend Bit Position */
#define XDMAC_GRS_RS21_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS21_Pos)                /* (XDMAC_GRS) XDMAC Channel 21 Read Suspend Bit Mask */
#define XDMAC_GRS_RS21(value)                 (XDMAC_GRS_RS21_Msk & (_UINT32_(value) << XDMAC_GRS_RS21_Pos)) /* Assigment of value for RS21 in the XDMAC_GRS register */
#define XDMAC_GRS_RS22_Pos                    _UINT32_(22)                                         /* (XDMAC_GRS) XDMAC Channel 22 Read Suspend Bit Position */
#define XDMAC_GRS_RS22_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS22_Pos)                /* (XDMAC_GRS) XDMAC Channel 22 Read Suspend Bit Mask */
#define XDMAC_GRS_RS22(value)                 (XDMAC_GRS_RS22_Msk & (_UINT32_(value) << XDMAC_GRS_RS22_Pos)) /* Assigment of value for RS22 in the XDMAC_GRS register */
#define XDMAC_GRS_RS23_Pos                    _UINT32_(23)                                         /* (XDMAC_GRS) XDMAC Channel 23 Read Suspend Bit Position */
#define XDMAC_GRS_RS23_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS23_Pos)                /* (XDMAC_GRS) XDMAC Channel 23 Read Suspend Bit Mask */
#define XDMAC_GRS_RS23(value)                 (XDMAC_GRS_RS23_Msk & (_UINT32_(value) << XDMAC_GRS_RS23_Pos)) /* Assigment of value for RS23 in the XDMAC_GRS register */
#define XDMAC_GRS_RS24_Pos                    _UINT32_(24)                                         /* (XDMAC_GRS) XDMAC Channel 24 Read Suspend Bit Position */
#define XDMAC_GRS_RS24_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS24_Pos)                /* (XDMAC_GRS) XDMAC Channel 24 Read Suspend Bit Mask */
#define XDMAC_GRS_RS24(value)                 (XDMAC_GRS_RS24_Msk & (_UINT32_(value) << XDMAC_GRS_RS24_Pos)) /* Assigment of value for RS24 in the XDMAC_GRS register */
#define XDMAC_GRS_RS25_Pos                    _UINT32_(25)                                         /* (XDMAC_GRS) XDMAC Channel 25 Read Suspend Bit Position */
#define XDMAC_GRS_RS25_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS25_Pos)                /* (XDMAC_GRS) XDMAC Channel 25 Read Suspend Bit Mask */
#define XDMAC_GRS_RS25(value)                 (XDMAC_GRS_RS25_Msk & (_UINT32_(value) << XDMAC_GRS_RS25_Pos)) /* Assigment of value for RS25 in the XDMAC_GRS register */
#define XDMAC_GRS_RS26_Pos                    _UINT32_(26)                                         /* (XDMAC_GRS) XDMAC Channel 26 Read Suspend Bit Position */
#define XDMAC_GRS_RS26_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS26_Pos)                /* (XDMAC_GRS) XDMAC Channel 26 Read Suspend Bit Mask */
#define XDMAC_GRS_RS26(value)                 (XDMAC_GRS_RS26_Msk & (_UINT32_(value) << XDMAC_GRS_RS26_Pos)) /* Assigment of value for RS26 in the XDMAC_GRS register */
#define XDMAC_GRS_RS27_Pos                    _UINT32_(27)                                         /* (XDMAC_GRS) XDMAC Channel 27 Read Suspend Bit Position */
#define XDMAC_GRS_RS27_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS27_Pos)                /* (XDMAC_GRS) XDMAC Channel 27 Read Suspend Bit Mask */
#define XDMAC_GRS_RS27(value)                 (XDMAC_GRS_RS27_Msk & (_UINT32_(value) << XDMAC_GRS_RS27_Pos)) /* Assigment of value for RS27 in the XDMAC_GRS register */
#define XDMAC_GRS_RS28_Pos                    _UINT32_(28)                                         /* (XDMAC_GRS) XDMAC Channel 28 Read Suspend Bit Position */
#define XDMAC_GRS_RS28_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS28_Pos)                /* (XDMAC_GRS) XDMAC Channel 28 Read Suspend Bit Mask */
#define XDMAC_GRS_RS28(value)                 (XDMAC_GRS_RS28_Msk & (_UINT32_(value) << XDMAC_GRS_RS28_Pos)) /* Assigment of value for RS28 in the XDMAC_GRS register */
#define XDMAC_GRS_RS29_Pos                    _UINT32_(29)                                         /* (XDMAC_GRS) XDMAC Channel 29 Read Suspend Bit Position */
#define XDMAC_GRS_RS29_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS29_Pos)                /* (XDMAC_GRS) XDMAC Channel 29 Read Suspend Bit Mask */
#define XDMAC_GRS_RS29(value)                 (XDMAC_GRS_RS29_Msk & (_UINT32_(value) << XDMAC_GRS_RS29_Pos)) /* Assigment of value for RS29 in the XDMAC_GRS register */
#define XDMAC_GRS_RS30_Pos                    _UINT32_(30)                                         /* (XDMAC_GRS) XDMAC Channel 30 Read Suspend Bit Position */
#define XDMAC_GRS_RS30_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS30_Pos)                /* (XDMAC_GRS) XDMAC Channel 30 Read Suspend Bit Mask */
#define XDMAC_GRS_RS30(value)                 (XDMAC_GRS_RS30_Msk & (_UINT32_(value) << XDMAC_GRS_RS30_Pos)) /* Assigment of value for RS30 in the XDMAC_GRS register */
#define XDMAC_GRS_RS31_Pos                    _UINT32_(31)                                         /* (XDMAC_GRS) XDMAC Channel 31 Read Suspend Bit Position */
#define XDMAC_GRS_RS31_Msk                    (_UINT32_(0x1) << XDMAC_GRS_RS31_Pos)                /* (XDMAC_GRS) XDMAC Channel 31 Read Suspend Bit Mask */
#define XDMAC_GRS_RS31(value)                 (XDMAC_GRS_RS31_Msk & (_UINT32_(value) << XDMAC_GRS_RS31_Pos)) /* Assigment of value for RS31 in the XDMAC_GRS register */
#define XDMAC_GRS_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (XDMAC_GRS) Register Mask  */

#define XDMAC_GRS_RS_Pos                      _UINT32_(0)                                          /* (XDMAC_GRS Position) XDMAC Channel 3x Read Suspend Bit */
#define XDMAC_GRS_RS_Msk                      (_UINT32_(0xFFFFFFFF) << XDMAC_GRS_RS_Pos)           /* (XDMAC_GRS Mask) RS */
#define XDMAC_GRS_RS(value)                   (XDMAC_GRS_RS_Msk & (_UINT32_(value) << XDMAC_GRS_RS_Pos)) 

