Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/xdmac.h
/* -------- XDMAC_GWS : (XDMAC Offset: 0x2C) (R/W 32) Global Channel Write Suspend Register -------- */
#define XDMAC_GWS_WS0_Pos                     _UINT32_(0)                                          /* (XDMAC_GWS) XDMAC Channel 0 Write Suspend Bit Position */
#define XDMAC_GWS_WS0_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS0_Pos)                 /* (XDMAC_GWS) XDMAC Channel 0 Write Suspend Bit Mask */
#define XDMAC_GWS_WS0(value)                  (XDMAC_GWS_WS0_Msk & (_UINT32_(value) << XDMAC_GWS_WS0_Pos)) /* Assigment of value for WS0 in the XDMAC_GWS register */
#define XDMAC_GWS_WS1_Pos                     _UINT32_(1)                                          /* (XDMAC_GWS) XDMAC Channel 1 Write Suspend Bit Position */
#define XDMAC_GWS_WS1_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS1_Pos)                 /* (XDMAC_GWS) XDMAC Channel 1 Write Suspend Bit Mask */
#define XDMAC_GWS_WS1(value)                  (XDMAC_GWS_WS1_Msk & (_UINT32_(value) << XDMAC_GWS_WS1_Pos)) /* Assigment of value for WS1 in the XDMAC_GWS register */
#define XDMAC_GWS_WS2_Pos                     _UINT32_(2)                                          /* (XDMAC_GWS) XDMAC Channel 2 Write Suspend Bit Position */
#define XDMAC_GWS_WS2_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS2_Pos)                 /* (XDMAC_GWS) XDMAC Channel 2 Write Suspend Bit Mask */
#define XDMAC_GWS_WS2(value)                  (XDMAC_GWS_WS2_Msk & (_UINT32_(value) << XDMAC_GWS_WS2_Pos)) /* Assigment of value for WS2 in the XDMAC_GWS register */
#define XDMAC_GWS_WS3_Pos                     _UINT32_(3)                                          /* (XDMAC_GWS) XDMAC Channel 3 Write Suspend Bit Position */
#define XDMAC_GWS_WS3_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS3_Pos)                 /* (XDMAC_GWS) XDMAC Channel 3 Write Suspend Bit Mask */
#define XDMAC_GWS_WS3(value)                  (XDMAC_GWS_WS3_Msk & (_UINT32_(value) << XDMAC_GWS_WS3_Pos)) /* Assigment of value for WS3 in the XDMAC_GWS register */
#define XDMAC_GWS_WS4_Pos                     _UINT32_(4)                                          /* (XDMAC_GWS) XDMAC Channel 4 Write Suspend Bit Position */
#define XDMAC_GWS_WS4_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS4_Pos)                 /* (XDMAC_GWS) XDMAC Channel 4 Write Suspend Bit Mask */
#define XDMAC_GWS_WS4(value)                  (XDMAC_GWS_WS4_Msk & (_UINT32_(value) << XDMAC_GWS_WS4_Pos)) /* Assigment of value for WS4 in the XDMAC_GWS register */
#define XDMAC_GWS_WS5_Pos                     _UINT32_(5)                                          /* (XDMAC_GWS) XDMAC Channel 5 Write Suspend Bit Position */
#define XDMAC_GWS_WS5_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS5_Pos)                 /* (XDMAC_GWS) XDMAC Channel 5 Write Suspend Bit Mask */
#define XDMAC_GWS_WS5(value)                  (XDMAC_GWS_WS5_Msk & (_UINT32_(value) << XDMAC_GWS_WS5_Pos)) /* Assigment of value for WS5 in the XDMAC_GWS register */
#define XDMAC_GWS_WS6_Pos                     _UINT32_(6)                                          /* (XDMAC_GWS) XDMAC Channel 6 Write Suspend Bit Position */
#define XDMAC_GWS_WS6_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS6_Pos)                 /* (XDMAC_GWS) XDMAC Channel 6 Write Suspend Bit Mask */
#define XDMAC_GWS_WS6(value)                  (XDMAC_GWS_WS6_Msk & (_UINT32_(value) << XDMAC_GWS_WS6_Pos)) /* Assigment of value for WS6 in the XDMAC_GWS register */
#define XDMAC_GWS_WS7_Pos                     _UINT32_(7)                                          /* (XDMAC_GWS) XDMAC Channel 7 Write Suspend Bit Position */
#define XDMAC_GWS_WS7_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS7_Pos)                 /* (XDMAC_GWS) XDMAC Channel 7 Write Suspend Bit Mask */
#define XDMAC_GWS_WS7(value)                  (XDMAC_GWS_WS7_Msk & (_UINT32_(value) << XDMAC_GWS_WS7_Pos)) /* Assigment of value for WS7 in the XDMAC_GWS register */
#define XDMAC_GWS_WS8_Pos                     _UINT32_(8)                                          /* (XDMAC_GWS) XDMAC Channel 8 Write Suspend Bit Position */
#define XDMAC_GWS_WS8_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS8_Pos)                 /* (XDMAC_GWS) XDMAC Channel 8 Write Suspend Bit Mask */
#define XDMAC_GWS_WS8(value)                  (XDMAC_GWS_WS8_Msk & (_UINT32_(value) << XDMAC_GWS_WS8_Pos)) /* Assigment of value for WS8 in the XDMAC_GWS register */
#define XDMAC_GWS_WS9_Pos                     _UINT32_(9)                                          /* (XDMAC_GWS) XDMAC Channel 9 Write Suspend Bit Position */
#define XDMAC_GWS_WS9_Msk                     (_UINT32_(0x1) << XDMAC_GWS_WS9_Pos)                 /* (XDMAC_GWS) XDMAC Channel 9 Write Suspend Bit Mask */
#define XDMAC_GWS_WS9(value)                  (XDMAC_GWS_WS9_Msk & (_UINT32_(value) << XDMAC_GWS_WS9_Pos)) /* Assigment of value for WS9 in the XDMAC_GWS register */
#define XDMAC_GWS_WS10_Pos                    _UINT32_(10)                                         /* (XDMAC_GWS) XDMAC Channel 10 Write Suspend Bit Position */
#define XDMAC_GWS_WS10_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS10_Pos)                /* (XDMAC_GWS) XDMAC Channel 10 Write Suspend Bit Mask */
#define XDMAC_GWS_WS10(value)                 (XDMAC_GWS_WS10_Msk & (_UINT32_(value) << XDMAC_GWS_WS10_Pos)) /* Assigment of value for WS10 in the XDMAC_GWS register */
#define XDMAC_GWS_WS11_Pos                    _UINT32_(11)                                         /* (XDMAC_GWS) XDMAC Channel 11 Write Suspend Bit Position */
#define XDMAC_GWS_WS11_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS11_Pos)                /* (XDMAC_GWS) XDMAC Channel 11 Write Suspend Bit Mask */
#define XDMAC_GWS_WS11(value)                 (XDMAC_GWS_WS11_Msk & (_UINT32_(value) << XDMAC_GWS_WS11_Pos)) /* Assigment of value for WS11 in the XDMAC_GWS register */
#define XDMAC_GWS_WS12_Pos                    _UINT32_(12)                                         /* (XDMAC_GWS) XDMAC Channel 12 Write Suspend Bit Position */
#define XDMAC_GWS_WS12_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS12_Pos)                /* (XDMAC_GWS) XDMAC Channel 12 Write Suspend Bit Mask */
#define XDMAC_GWS_WS12(value)                 (XDMAC_GWS_WS12_Msk & (_UINT32_(value) << XDMAC_GWS_WS12_Pos)) /* Assigment of value for WS12 in the XDMAC_GWS register */
#define XDMAC_GWS_WS13_Pos                    _UINT32_(13)                                         /* (XDMAC_GWS) XDMAC Channel 13 Write Suspend Bit Position */
#define XDMAC_GWS_WS13_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS13_Pos)                /* (XDMAC_GWS) XDMAC Channel 13 Write Suspend Bit Mask */
#define XDMAC_GWS_WS13(value)                 (XDMAC_GWS_WS13_Msk & (_UINT32_(value) << XDMAC_GWS_WS13_Pos)) /* Assigment of value for WS13 in the XDMAC_GWS register */
#define XDMAC_GWS_WS14_Pos                    _UINT32_(14)                                         /* (XDMAC_GWS) XDMAC Channel 14 Write Suspend Bit Position */
#define XDMAC_GWS_WS14_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS14_Pos)                /* (XDMAC_GWS) XDMAC Channel 14 Write Suspend Bit Mask */
#define XDMAC_GWS_WS14(value)                 (XDMAC_GWS_WS14_Msk & (_UINT32_(value) << XDMAC_GWS_WS14_Pos)) /* Assigment of value for WS14 in the XDMAC_GWS register */
#define XDMAC_GWS_WS15_Pos                    _UINT32_(15)                                         /* (XDMAC_GWS) XDMAC Channel 15 Write Suspend Bit Position */
#define XDMAC_GWS_WS15_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS15_Pos)                /* (XDMAC_GWS) XDMAC Channel 15 Write Suspend Bit Mask */
#define XDMAC_GWS_WS15(value)                 (XDMAC_GWS_WS15_Msk & (_UINT32_(value) << XDMAC_GWS_WS15_Pos)) /* Assigment of value for WS15 in the XDMAC_GWS register */
#define XDMAC_GWS_WS16_Pos                    _UINT32_(16)                                         /* (XDMAC_GWS) XDMAC Channel 16 Write Suspend Bit Position */
#define XDMAC_GWS_WS16_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS16_Pos)                /* (XDMAC_GWS) XDMAC Channel 16 Write Suspend Bit Mask */
#define XDMAC_GWS_WS16(value)                 (XDMAC_GWS_WS16_Msk & (_UINT32_(value) << XDMAC_GWS_WS16_Pos)) /* Assigment of value for WS16 in the XDMAC_GWS register */
#define XDMAC_GWS_WS17_Pos                    _UINT32_(17)                                         /* (XDMAC_GWS) XDMAC Channel 17 Write Suspend Bit Position */
#define XDMAC_GWS_WS17_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS17_Pos)                /* (XDMAC_GWS) XDMAC Channel 17 Write Suspend Bit Mask */
#define XDMAC_GWS_WS17(value)                 (XDMAC_GWS_WS17_Msk & (_UINT32_(value) << XDMAC_GWS_WS17_Pos)) /* Assigment of value for WS17 in the XDMAC_GWS register */
#define XDMAC_GWS_WS18_Pos                    _UINT32_(18)                                         /* (XDMAC_GWS) XDMAC Channel 18 Write Suspend Bit Position */
#define XDMAC_GWS_WS18_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS18_Pos)                /* (XDMAC_GWS) XDMAC Channel 18 Write Suspend Bit Mask */
#define XDMAC_GWS_WS18(value)                 (XDMAC_GWS_WS18_Msk & (_UINT32_(value) << XDMAC_GWS_WS18_Pos)) /* Assigment of value for WS18 in the XDMAC_GWS register */
#define XDMAC_GWS_WS19_Pos                    _UINT32_(19)                                         /* (XDMAC_GWS) XDMAC Channel 19 Write Suspend Bit Position */
#define XDMAC_GWS_WS19_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS19_Pos)                /* (XDMAC_GWS) XDMAC Channel 19 Write Suspend Bit Mask */
#define XDMAC_GWS_WS19(value)                 (XDMAC_GWS_WS19_Msk & (_UINT32_(value) << XDMAC_GWS_WS19_Pos)) /* Assigment of value for WS19 in the XDMAC_GWS register */
#define XDMAC_GWS_WS20_Pos                    _UINT32_(20)                                         /* (XDMAC_GWS) XDMAC Channel 20 Write Suspend Bit Position */
#define XDMAC_GWS_WS20_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS20_Pos)                /* (XDMAC_GWS) XDMAC Channel 20 Write Suspend Bit Mask */
#define XDMAC_GWS_WS20(value)                 (XDMAC_GWS_WS20_Msk & (_UINT32_(value) << XDMAC_GWS_WS20_Pos)) /* Assigment of value for WS20 in the XDMAC_GWS register */
#define XDMAC_GWS_WS21_Pos                    _UINT32_(21)                                         /* (XDMAC_GWS) XDMAC Channel 21 Write Suspend Bit Position */
#define XDMAC_GWS_WS21_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS21_Pos)                /* (XDMAC_GWS) XDMAC Channel 21 Write Suspend Bit Mask */
#define XDMAC_GWS_WS21(value)                 (XDMAC_GWS_WS21_Msk & (_UINT32_(value) << XDMAC_GWS_WS21_Pos)) /* Assigment of value for WS21 in the XDMAC_GWS register */
#define XDMAC_GWS_WS22_Pos                    _UINT32_(22)                                         /* (XDMAC_GWS) XDMAC Channel 22 Write Suspend Bit Position */
#define XDMAC_GWS_WS22_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS22_Pos)                /* (XDMAC_GWS) XDMAC Channel 22 Write Suspend Bit Mask */
#define XDMAC_GWS_WS22(value)                 (XDMAC_GWS_WS22_Msk & (_UINT32_(value) << XDMAC_GWS_WS22_Pos)) /* Assigment of value for WS22 in the XDMAC_GWS register */
#define XDMAC_GWS_WS23_Pos                    _UINT32_(23)                                         /* (XDMAC_GWS) XDMAC Channel 23 Write Suspend Bit Position */
#define XDMAC_GWS_WS23_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS23_Pos)                /* (XDMAC_GWS) XDMAC Channel 23 Write Suspend Bit Mask */
#define XDMAC_GWS_WS23(value)                 (XDMAC_GWS_WS23_Msk & (_UINT32_(value) << XDMAC_GWS_WS23_Pos)) /* Assigment of value for WS23 in the XDMAC_GWS register */
#define XDMAC_GWS_WS24_Pos                    _UINT32_(24)                                         /* (XDMAC_GWS) XDMAC Channel 24 Write Suspend Bit Position */
#define XDMAC_GWS_WS24_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS24_Pos)                /* (XDMAC_GWS) XDMAC Channel 24 Write Suspend Bit Mask */
#define XDMAC_GWS_WS24(value)                 (XDMAC_GWS_WS24_Msk & (_UINT32_(value) << XDMAC_GWS_WS24_Pos)) /* Assigment of value for WS24 in the XDMAC_GWS register */
#define XDMAC_GWS_WS25_Pos                    _UINT32_(25)                                         /* (XDMAC_GWS) XDMAC Channel 25 Write Suspend Bit Position */
#define XDMAC_GWS_WS25_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS25_Pos)                /* (XDMAC_GWS) XDMAC Channel 25 Write Suspend Bit Mask */
#define XDMAC_GWS_WS25(value)                 (XDMAC_GWS_WS25_Msk & (_UINT32_(value) << XDMAC_GWS_WS25_Pos)) /* Assigment of value for WS25 in the XDMAC_GWS register */
#define XDMAC_GWS_WS26_Pos                    _UINT32_(26)                                         /* (XDMAC_GWS) XDMAC Channel 26 Write Suspend Bit Position */
#define XDMAC_GWS_WS26_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS26_Pos)                /* (XDMAC_GWS) XDMAC Channel 26 Write Suspend Bit Mask */
#define XDMAC_GWS_WS26(value)                 (XDMAC_GWS_WS26_Msk & (_UINT32_(value) << XDMAC_GWS_WS26_Pos)) /* Assigment of value for WS26 in the XDMAC_GWS register */
#define XDMAC_GWS_WS27_Pos                    _UINT32_(27)                                         /* (XDMAC_GWS) XDMAC Channel 27 Write Suspend Bit Position */
#define XDMAC_GWS_WS27_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS27_Pos)                /* (XDMAC_GWS) XDMAC Channel 27 Write Suspend Bit Mask */
#define XDMAC_GWS_WS27(value)                 (XDMAC_GWS_WS27_Msk & (_UINT32_(value) << XDMAC_GWS_WS27_Pos)) /* Assigment of value for WS27 in the XDMAC_GWS register */
#define XDMAC_GWS_WS28_Pos                    _UINT32_(28)                                         /* (XDMAC_GWS) XDMAC Channel 28 Write Suspend Bit Position */
#define XDMAC_GWS_WS28_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS28_Pos)                /* (XDMAC_GWS) XDMAC Channel 28 Write Suspend Bit Mask */
#define XDMAC_GWS_WS28(value)                 (XDMAC_GWS_WS28_Msk & (_UINT32_(value) << XDMAC_GWS_WS28_Pos)) /* Assigment of value for WS28 in the XDMAC_GWS register */
#define XDMAC_GWS_WS29_Pos                    _UINT32_(29)                                         /* (XDMAC_GWS) XDMAC Channel 29 Write Suspend Bit Position */
#define XDMAC_GWS_WS29_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS29_Pos)                /* (XDMAC_GWS) XDMAC Channel 29 Write Suspend Bit Mask */
#define XDMAC_GWS_WS29(value)                 (XDMAC_GWS_WS29_Msk & (_UINT32_(value) << XDMAC_GWS_WS29_Pos)) /* Assigment of value for WS29 in the XDMAC_GWS register */
#define XDMAC_GWS_WS30_Pos                    _UINT32_(30)                                         /* (XDMAC_GWS) XDMAC Channel 30 Write Suspend Bit Position */
#define XDMAC_GWS_WS30_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS30_Pos)                /* (XDMAC_GWS) XDMAC Channel 30 Write Suspend Bit Mask */
#define XDMAC_GWS_WS30(value)                 (XDMAC_GWS_WS30_Msk & (_UINT32_(value) << XDMAC_GWS_WS30_Pos)) /* Assigment of value for WS30 in the XDMAC_GWS register */
#define XDMAC_GWS_WS31_Pos                    _UINT32_(31)                                         /* (XDMAC_GWS) XDMAC Channel 31 Write Suspend Bit Position */
#define XDMAC_GWS_WS31_Msk                    (_UINT32_(0x1) << XDMAC_GWS_WS31_Pos)                /* (XDMAC_GWS) XDMAC Channel 31 Write Suspend Bit Mask */
#define XDMAC_GWS_WS31(value)                 (XDMAC_GWS_WS31_Msk & (_UINT32_(value) << XDMAC_GWS_WS31_Pos)) /* Assigment of value for WS31 in the XDMAC_GWS register */
#define XDMAC_GWS_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (XDMAC_GWS) Register Mask  */

#define XDMAC_GWS_WS_Pos                      _UINT32_(0)                                          /* (XDMAC_GWS Position) XDMAC Channel 3x Write Suspend Bit */
#define XDMAC_GWS_WS_Msk                      (_UINT32_(0xFFFFFFFF) << XDMAC_GWS_WS_Pos)           /* (XDMAC_GWS Mask) WS */
#define XDMAC_GWS_WS(value)                   (XDMAC_GWS_WS_Msk & (_UINT32_(value) << XDMAC_GWS_WS_Pos)) 

