Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/xdmac.h
/* -------- XDMAC_GRWS : (XDMAC Offset: 0x30) ( /W 32) Global Channel Read Write Suspend Register -------- */
#define XDMAC_GRWS_RWS0_Pos                   _UINT32_(0)                                          /* (XDMAC_GRWS) XDMAC Channel 0 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS0_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS0_Pos)               /* (XDMAC_GRWS) XDMAC Channel 0 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS0(value)                (XDMAC_GRWS_RWS0_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS0_Pos)) /* Assigment of value for RWS0 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS1_Pos                   _UINT32_(1)                                          /* (XDMAC_GRWS) XDMAC Channel 1 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS1_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS1_Pos)               /* (XDMAC_GRWS) XDMAC Channel 1 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS1(value)                (XDMAC_GRWS_RWS1_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS1_Pos)) /* Assigment of value for RWS1 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS2_Pos                   _UINT32_(2)                                          /* (XDMAC_GRWS) XDMAC Channel 2 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS2_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS2_Pos)               /* (XDMAC_GRWS) XDMAC Channel 2 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS2(value)                (XDMAC_GRWS_RWS2_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS2_Pos)) /* Assigment of value for RWS2 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS3_Pos                   _UINT32_(3)                                          /* (XDMAC_GRWS) XDMAC Channel 3 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS3_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS3_Pos)               /* (XDMAC_GRWS) XDMAC Channel 3 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS3(value)                (XDMAC_GRWS_RWS3_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS3_Pos)) /* Assigment of value for RWS3 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS4_Pos                   _UINT32_(4)                                          /* (XDMAC_GRWS) XDMAC Channel 4 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS4_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS4_Pos)               /* (XDMAC_GRWS) XDMAC Channel 4 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS4(value)                (XDMAC_GRWS_RWS4_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS4_Pos)) /* Assigment of value for RWS4 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS5_Pos                   _UINT32_(5)                                          /* (XDMAC_GRWS) XDMAC Channel 5 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS5_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS5_Pos)               /* (XDMAC_GRWS) XDMAC Channel 5 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS5(value)                (XDMAC_GRWS_RWS5_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS5_Pos)) /* Assigment of value for RWS5 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS6_Pos                   _UINT32_(6)                                          /* (XDMAC_GRWS) XDMAC Channel 6 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS6_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS6_Pos)               /* (XDMAC_GRWS) XDMAC Channel 6 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS6(value)                (XDMAC_GRWS_RWS6_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS6_Pos)) /* Assigment of value for RWS6 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS7_Pos                   _UINT32_(7)                                          /* (XDMAC_GRWS) XDMAC Channel 7 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS7_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS7_Pos)               /* (XDMAC_GRWS) XDMAC Channel 7 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS7(value)                (XDMAC_GRWS_RWS7_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS7_Pos)) /* Assigment of value for RWS7 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS8_Pos                   _UINT32_(8)                                          /* (XDMAC_GRWS) XDMAC Channel 8 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS8_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS8_Pos)               /* (XDMAC_GRWS) XDMAC Channel 8 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS8(value)                (XDMAC_GRWS_RWS8_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS8_Pos)) /* Assigment of value for RWS8 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS9_Pos                   _UINT32_(9)                                          /* (XDMAC_GRWS) XDMAC Channel 9 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS9_Msk                   (_UINT32_(0x1) << XDMAC_GRWS_RWS9_Pos)               /* (XDMAC_GRWS) XDMAC Channel 9 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS9(value)                (XDMAC_GRWS_RWS9_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS9_Pos)) /* Assigment of value for RWS9 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS10_Pos                  _UINT32_(10)                                         /* (XDMAC_GRWS) XDMAC Channel 10 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS10_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS10_Pos)              /* (XDMAC_GRWS) XDMAC Channel 10 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS10(value)               (XDMAC_GRWS_RWS10_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS10_Pos)) /* Assigment of value for RWS10 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS11_Pos                  _UINT32_(11)                                         /* (XDMAC_GRWS) XDMAC Channel 11 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS11_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS11_Pos)              /* (XDMAC_GRWS) XDMAC Channel 11 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS11(value)               (XDMAC_GRWS_RWS11_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS11_Pos)) /* Assigment of value for RWS11 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS12_Pos                  _UINT32_(12)                                         /* (XDMAC_GRWS) XDMAC Channel 12 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS12_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS12_Pos)              /* (XDMAC_GRWS) XDMAC Channel 12 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS12(value)               (XDMAC_GRWS_RWS12_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS12_Pos)) /* Assigment of value for RWS12 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS13_Pos                  _UINT32_(13)                                         /* (XDMAC_GRWS) XDMAC Channel 13 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS13_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS13_Pos)              /* (XDMAC_GRWS) XDMAC Channel 13 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS13(value)               (XDMAC_GRWS_RWS13_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS13_Pos)) /* Assigment of value for RWS13 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS14_Pos                  _UINT32_(14)                                         /* (XDMAC_GRWS) XDMAC Channel 14 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS14_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS14_Pos)              /* (XDMAC_GRWS) XDMAC Channel 14 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS14(value)               (XDMAC_GRWS_RWS14_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS14_Pos)) /* Assigment of value for RWS14 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS15_Pos                  _UINT32_(15)                                         /* (XDMAC_GRWS) XDMAC Channel 15 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS15_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS15_Pos)              /* (XDMAC_GRWS) XDMAC Channel 15 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS15(value)               (XDMAC_GRWS_RWS15_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS15_Pos)) /* Assigment of value for RWS15 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS16_Pos                  _UINT32_(16)                                         /* (XDMAC_GRWS) XDMAC Channel 16 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS16_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS16_Pos)              /* (XDMAC_GRWS) XDMAC Channel 16 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS16(value)               (XDMAC_GRWS_RWS16_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS16_Pos)) /* Assigment of value for RWS16 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS17_Pos                  _UINT32_(17)                                         /* (XDMAC_GRWS) XDMAC Channel 17 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS17_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS17_Pos)              /* (XDMAC_GRWS) XDMAC Channel 17 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS17(value)               (XDMAC_GRWS_RWS17_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS17_Pos)) /* Assigment of value for RWS17 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS18_Pos                  _UINT32_(18)                                         /* (XDMAC_GRWS) XDMAC Channel 18 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS18_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS18_Pos)              /* (XDMAC_GRWS) XDMAC Channel 18 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS18(value)               (XDMAC_GRWS_RWS18_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS18_Pos)) /* Assigment of value for RWS18 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS19_Pos                  _UINT32_(19)                                         /* (XDMAC_GRWS) XDMAC Channel 19 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS19_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS19_Pos)              /* (XDMAC_GRWS) XDMAC Channel 19 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS19(value)               (XDMAC_GRWS_RWS19_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS19_Pos)) /* Assigment of value for RWS19 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS20_Pos                  _UINT32_(20)                                         /* (XDMAC_GRWS) XDMAC Channel 20 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS20_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS20_Pos)              /* (XDMAC_GRWS) XDMAC Channel 20 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS20(value)               (XDMAC_GRWS_RWS20_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS20_Pos)) /* Assigment of value for RWS20 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS21_Pos                  _UINT32_(21)                                         /* (XDMAC_GRWS) XDMAC Channel 21 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS21_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS21_Pos)              /* (XDMAC_GRWS) XDMAC Channel 21 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS21(value)               (XDMAC_GRWS_RWS21_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS21_Pos)) /* Assigment of value for RWS21 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS22_Pos                  _UINT32_(22)                                         /* (XDMAC_GRWS) XDMAC Channel 22 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS22_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS22_Pos)              /* (XDMAC_GRWS) XDMAC Channel 22 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS22(value)               (XDMAC_GRWS_RWS22_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS22_Pos)) /* Assigment of value for RWS22 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS23_Pos                  _UINT32_(23)                                         /* (XDMAC_GRWS) XDMAC Channel 23 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS23_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS23_Pos)              /* (XDMAC_GRWS) XDMAC Channel 23 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS23(value)               (XDMAC_GRWS_RWS23_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS23_Pos)) /* Assigment of value for RWS23 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS24_Pos                  _UINT32_(24)                                         /* (XDMAC_GRWS) XDMAC Channel 24 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS24_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS24_Pos)              /* (XDMAC_GRWS) XDMAC Channel 24 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS24(value)               (XDMAC_GRWS_RWS24_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS24_Pos)) /* Assigment of value for RWS24 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS25_Pos                  _UINT32_(25)                                         /* (XDMAC_GRWS) XDMAC Channel 25 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS25_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS25_Pos)              /* (XDMAC_GRWS) XDMAC Channel 25 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS25(value)               (XDMAC_GRWS_RWS25_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS25_Pos)) /* Assigment of value for RWS25 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS26_Pos                  _UINT32_(26)                                         /* (XDMAC_GRWS) XDMAC Channel 26 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS26_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS26_Pos)              /* (XDMAC_GRWS) XDMAC Channel 26 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS26(value)               (XDMAC_GRWS_RWS26_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS26_Pos)) /* Assigment of value for RWS26 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS27_Pos                  _UINT32_(27)                                         /* (XDMAC_GRWS) XDMAC Channel 27 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS27_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS27_Pos)              /* (XDMAC_GRWS) XDMAC Channel 27 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS27(value)               (XDMAC_GRWS_RWS27_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS27_Pos)) /* Assigment of value for RWS27 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS28_Pos                  _UINT32_(28)                                         /* (XDMAC_GRWS) XDMAC Channel 28 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS28_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS28_Pos)              /* (XDMAC_GRWS) XDMAC Channel 28 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS28(value)               (XDMAC_GRWS_RWS28_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS28_Pos)) /* Assigment of value for RWS28 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS29_Pos                  _UINT32_(29)                                         /* (XDMAC_GRWS) XDMAC Channel 29 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS29_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS29_Pos)              /* (XDMAC_GRWS) XDMAC Channel 29 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS29(value)               (XDMAC_GRWS_RWS29_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS29_Pos)) /* Assigment of value for RWS29 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS30_Pos                  _UINT32_(30)                                         /* (XDMAC_GRWS) XDMAC Channel 30 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS30_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS30_Pos)              /* (XDMAC_GRWS) XDMAC Channel 30 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS30(value)               (XDMAC_GRWS_RWS30_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS30_Pos)) /* Assigment of value for RWS30 in the XDMAC_GRWS register */
#define XDMAC_GRWS_RWS31_Pos                  _UINT32_(31)                                         /* (XDMAC_GRWS) XDMAC Channel 31 Read Write Suspend Bit Position */
#define XDMAC_GRWS_RWS31_Msk                  (_UINT32_(0x1) << XDMAC_GRWS_RWS31_Pos)              /* (XDMAC_GRWS) XDMAC Channel 31 Read Write Suspend Bit Mask */
#define XDMAC_GRWS_RWS31(value)               (XDMAC_GRWS_RWS31_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS31_Pos)) /* Assigment of value for RWS31 in the XDMAC_GRWS register */
#define XDMAC_GRWS_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (XDMAC_GRWS) Register Mask  */

#define XDMAC_GRWS_RWS_Pos                    _UINT32_(0)                                          /* (XDMAC_GRWS Position) XDMAC Channel 3x Read Write Suspend Bit */
#define XDMAC_GRWS_RWS_Msk                    (_UINT32_(0xFFFFFFFF) << XDMAC_GRWS_RWS_Pos)         /* (XDMAC_GRWS Mask) RWS */
#define XDMAC_GRWS_RWS(value)                 (XDMAC_GRWS_RWS_Msk & (_UINT32_(value) << XDMAC_GRWS_RWS_Pos)) 

