Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/xdmac.h
/* -------- XDMAC_GSWS : (XDMAC Offset: 0x3C) ( R/ 32) Global Channel Software Request Status Register -------- */
#define XDMAC_GSWS_SWRS0_Pos                  _UINT32_(0)                                          /* (XDMAC_GSWS) XDMAC Channel 0 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS0_Msk                  (_UINT32_(0x1) << XDMAC_GSWS_SWRS0_Pos)              /* (XDMAC_GSWS) XDMAC Channel 0 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS0(value)               (XDMAC_GSWS_SWRS0_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS0_Pos)) /* Assigment of value for SWRS0 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS1_Pos                  _UINT32_(1)                                          /* (XDMAC_GSWS) XDMAC Channel 1 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS1_Msk                  (_UINT32_(0x1) << XDMAC_GSWS_SWRS1_Pos)              /* (XDMAC_GSWS) XDMAC Channel 1 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS1(value)               (XDMAC_GSWS_SWRS1_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS1_Pos)) /* Assigment of value for SWRS1 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS2_Pos                  _UINT32_(2)                                          /* (XDMAC_GSWS) XDMAC Channel 2 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS2_Msk                  (_UINT32_(0x1) << XDMAC_GSWS_SWRS2_Pos)              /* (XDMAC_GSWS) XDMAC Channel 2 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS2(value)               (XDMAC_GSWS_SWRS2_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS2_Pos)) /* Assigment of value for SWRS2 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS3_Pos                  _UINT32_(3)                                          /* (XDMAC_GSWS) XDMAC Channel 3 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS3_Msk                  (_UINT32_(0x1) << XDMAC_GSWS_SWRS3_Pos)              /* (XDMAC_GSWS) XDMAC Channel 3 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS3(value)               (XDMAC_GSWS_SWRS3_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS3_Pos)) /* Assigment of value for SWRS3 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS4_Pos                  _UINT32_(4)                                          /* (XDMAC_GSWS) XDMAC Channel 4 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS4_Msk                  (_UINT32_(0x1) << XDMAC_GSWS_SWRS4_Pos)              /* (XDMAC_GSWS) XDMAC Channel 4 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS4(value)               (XDMAC_GSWS_SWRS4_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS4_Pos)) /* Assigment of value for SWRS4 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS5_Pos                  _UINT32_(5)                                          /* (XDMAC_GSWS) XDMAC Channel 5 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS5_Msk                  (_UINT32_(0x1) << XDMAC_GSWS_SWRS5_Pos)              /* (XDMAC_GSWS) XDMAC Channel 5 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS5(value)               (XDMAC_GSWS_SWRS5_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS5_Pos)) /* Assigment of value for SWRS5 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS6_Pos                  _UINT32_(6)                                          /* (XDMAC_GSWS) XDMAC Channel 6 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS6_Msk                  (_UINT32_(0x1) << XDMAC_GSWS_SWRS6_Pos)              /* (XDMAC_GSWS) XDMAC Channel 6 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS6(value)               (XDMAC_GSWS_SWRS6_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS6_Pos)) /* Assigment of value for SWRS6 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS7_Pos                  _UINT32_(7)                                          /* (XDMAC_GSWS) XDMAC Channel 7 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS7_Msk                  (_UINT32_(0x1) << XDMAC_GSWS_SWRS7_Pos)              /* (XDMAC_GSWS) XDMAC Channel 7 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS7(value)               (XDMAC_GSWS_SWRS7_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS7_Pos)) /* Assigment of value for SWRS7 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS8_Pos                  _UINT32_(8)                                          /* (XDMAC_GSWS) XDMAC Channel 8 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS8_Msk                  (_UINT32_(0x1) << XDMAC_GSWS_SWRS8_Pos)              /* (XDMAC_GSWS) XDMAC Channel 8 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS8(value)               (XDMAC_GSWS_SWRS8_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS8_Pos)) /* Assigment of value for SWRS8 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS9_Pos                  _UINT32_(9)                                          /* (XDMAC_GSWS) XDMAC Channel 9 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS9_Msk                  (_UINT32_(0x1) << XDMAC_GSWS_SWRS9_Pos)              /* (XDMAC_GSWS) XDMAC Channel 9 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS9(value)               (XDMAC_GSWS_SWRS9_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS9_Pos)) /* Assigment of value for SWRS9 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS10_Pos                 _UINT32_(10)                                         /* (XDMAC_GSWS) XDMAC Channel 10 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS10_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS10_Pos)             /* (XDMAC_GSWS) XDMAC Channel 10 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS10(value)              (XDMAC_GSWS_SWRS10_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS10_Pos)) /* Assigment of value for SWRS10 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS11_Pos                 _UINT32_(11)                                         /* (XDMAC_GSWS) XDMAC Channel 11 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS11_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS11_Pos)             /* (XDMAC_GSWS) XDMAC Channel 11 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS11(value)              (XDMAC_GSWS_SWRS11_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS11_Pos)) /* Assigment of value for SWRS11 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS12_Pos                 _UINT32_(12)                                         /* (XDMAC_GSWS) XDMAC Channel 12 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS12_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS12_Pos)             /* (XDMAC_GSWS) XDMAC Channel 12 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS12(value)              (XDMAC_GSWS_SWRS12_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS12_Pos)) /* Assigment of value for SWRS12 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS13_Pos                 _UINT32_(13)                                         /* (XDMAC_GSWS) XDMAC Channel 13 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS13_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS13_Pos)             /* (XDMAC_GSWS) XDMAC Channel 13 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS13(value)              (XDMAC_GSWS_SWRS13_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS13_Pos)) /* Assigment of value for SWRS13 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS14_Pos                 _UINT32_(14)                                         /* (XDMAC_GSWS) XDMAC Channel 14 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS14_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS14_Pos)             /* (XDMAC_GSWS) XDMAC Channel 14 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS14(value)              (XDMAC_GSWS_SWRS14_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS14_Pos)) /* Assigment of value for SWRS14 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS15_Pos                 _UINT32_(15)                                         /* (XDMAC_GSWS) XDMAC Channel 15 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS15_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS15_Pos)             /* (XDMAC_GSWS) XDMAC Channel 15 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS15(value)              (XDMAC_GSWS_SWRS15_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS15_Pos)) /* Assigment of value for SWRS15 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS16_Pos                 _UINT32_(16)                                         /* (XDMAC_GSWS) XDMAC Channel 16 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS16_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS16_Pos)             /* (XDMAC_GSWS) XDMAC Channel 16 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS16(value)              (XDMAC_GSWS_SWRS16_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS16_Pos)) /* Assigment of value for SWRS16 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS17_Pos                 _UINT32_(17)                                         /* (XDMAC_GSWS) XDMAC Channel 17 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS17_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS17_Pos)             /* (XDMAC_GSWS) XDMAC Channel 17 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS17(value)              (XDMAC_GSWS_SWRS17_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS17_Pos)) /* Assigment of value for SWRS17 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS18_Pos                 _UINT32_(18)                                         /* (XDMAC_GSWS) XDMAC Channel 18 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS18_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS18_Pos)             /* (XDMAC_GSWS) XDMAC Channel 18 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS18(value)              (XDMAC_GSWS_SWRS18_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS18_Pos)) /* Assigment of value for SWRS18 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS19_Pos                 _UINT32_(19)                                         /* (XDMAC_GSWS) XDMAC Channel 19 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS19_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS19_Pos)             /* (XDMAC_GSWS) XDMAC Channel 19 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS19(value)              (XDMAC_GSWS_SWRS19_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS19_Pos)) /* Assigment of value for SWRS19 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS20_Pos                 _UINT32_(20)                                         /* (XDMAC_GSWS) XDMAC Channel 20 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS20_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS20_Pos)             /* (XDMAC_GSWS) XDMAC Channel 20 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS20(value)              (XDMAC_GSWS_SWRS20_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS20_Pos)) /* Assigment of value for SWRS20 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS21_Pos                 _UINT32_(21)                                         /* (XDMAC_GSWS) XDMAC Channel 21 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS21_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS21_Pos)             /* (XDMAC_GSWS) XDMAC Channel 21 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS21(value)              (XDMAC_GSWS_SWRS21_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS21_Pos)) /* Assigment of value for SWRS21 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS22_Pos                 _UINT32_(22)                                         /* (XDMAC_GSWS) XDMAC Channel 22 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS22_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS22_Pos)             /* (XDMAC_GSWS) XDMAC Channel 22 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS22(value)              (XDMAC_GSWS_SWRS22_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS22_Pos)) /* Assigment of value for SWRS22 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS23_Pos                 _UINT32_(23)                                         /* (XDMAC_GSWS) XDMAC Channel 23 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS23_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS23_Pos)             /* (XDMAC_GSWS) XDMAC Channel 23 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS23(value)              (XDMAC_GSWS_SWRS23_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS23_Pos)) /* Assigment of value for SWRS23 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS24_Pos                 _UINT32_(24)                                         /* (XDMAC_GSWS) XDMAC Channel 24 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS24_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS24_Pos)             /* (XDMAC_GSWS) XDMAC Channel 24 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS24(value)              (XDMAC_GSWS_SWRS24_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS24_Pos)) /* Assigment of value for SWRS24 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS25_Pos                 _UINT32_(25)                                         /* (XDMAC_GSWS) XDMAC Channel 25 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS25_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS25_Pos)             /* (XDMAC_GSWS) XDMAC Channel 25 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS25(value)              (XDMAC_GSWS_SWRS25_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS25_Pos)) /* Assigment of value for SWRS25 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS26_Pos                 _UINT32_(26)                                         /* (XDMAC_GSWS) XDMAC Channel 26 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS26_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS26_Pos)             /* (XDMAC_GSWS) XDMAC Channel 26 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS26(value)              (XDMAC_GSWS_SWRS26_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS26_Pos)) /* Assigment of value for SWRS26 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS27_Pos                 _UINT32_(27)                                         /* (XDMAC_GSWS) XDMAC Channel 27 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS27_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS27_Pos)             /* (XDMAC_GSWS) XDMAC Channel 27 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS27(value)              (XDMAC_GSWS_SWRS27_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS27_Pos)) /* Assigment of value for SWRS27 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS28_Pos                 _UINT32_(28)                                         /* (XDMAC_GSWS) XDMAC Channel 28 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS28_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS28_Pos)             /* (XDMAC_GSWS) XDMAC Channel 28 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS28(value)              (XDMAC_GSWS_SWRS28_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS28_Pos)) /* Assigment of value for SWRS28 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS29_Pos                 _UINT32_(29)                                         /* (XDMAC_GSWS) XDMAC Channel 29 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS29_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS29_Pos)             /* (XDMAC_GSWS) XDMAC Channel 29 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS29(value)              (XDMAC_GSWS_SWRS29_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS29_Pos)) /* Assigment of value for SWRS29 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS30_Pos                 _UINT32_(30)                                         /* (XDMAC_GSWS) XDMAC Channel 30 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS30_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS30_Pos)             /* (XDMAC_GSWS) XDMAC Channel 30 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS30(value)              (XDMAC_GSWS_SWRS30_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS30_Pos)) /* Assigment of value for SWRS30 in the XDMAC_GSWS register */
#define XDMAC_GSWS_SWRS31_Pos                 _UINT32_(31)                                         /* (XDMAC_GSWS) XDMAC Channel 31 Software Request Status Bit Position */
#define XDMAC_GSWS_SWRS31_Msk                 (_UINT32_(0x1) << XDMAC_GSWS_SWRS31_Pos)             /* (XDMAC_GSWS) XDMAC Channel 31 Software Request Status Bit Mask */
#define XDMAC_GSWS_SWRS31(value)              (XDMAC_GSWS_SWRS31_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS31_Pos)) /* Assigment of value for SWRS31 in the XDMAC_GSWS register */
#define XDMAC_GSWS_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (XDMAC_GSWS) Register Mask  */

#define XDMAC_GSWS_SWRS_Pos                   _UINT32_(0)                                          /* (XDMAC_GSWS Position) XDMAC Channel 3x Software Request Status Bit */
#define XDMAC_GSWS_SWRS_Msk                   (_UINT32_(0xFFFFFFFF) << XDMAC_GSWS_SWRS_Pos)        /* (XDMAC_GSWS Mask) SWRS */
#define XDMAC_GSWS_SWRS(value)                (XDMAC_GSWS_SWRS_Msk & (_UINT32_(value) << XDMAC_GSWS_SWRS_Pos)) 

