Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/xdmac.h
/* -------- XDMAC_GSWF : (XDMAC Offset: 0x40) ( /W 32) Global Channel Software Flush Request Register -------- */
#define XDMAC_GSWF_SWF0_Pos                   _UINT32_(0)                                          /* (XDMAC_GSWF) XDMAC Channel 0 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF0_Msk                   (_UINT32_(0x1) << XDMAC_GSWF_SWF0_Pos)               /* (XDMAC_GSWF) XDMAC Channel 0 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF0(value)                (XDMAC_GSWF_SWF0_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF0_Pos)) /* Assigment of value for SWF0 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF1_Pos                   _UINT32_(1)                                          /* (XDMAC_GSWF) XDMAC Channel 1 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF1_Msk                   (_UINT32_(0x1) << XDMAC_GSWF_SWF1_Pos)               /* (XDMAC_GSWF) XDMAC Channel 1 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF1(value)                (XDMAC_GSWF_SWF1_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF1_Pos)) /* Assigment of value for SWF1 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF2_Pos                   _UINT32_(2)                                          /* (XDMAC_GSWF) XDMAC Channel 2 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF2_Msk                   (_UINT32_(0x1) << XDMAC_GSWF_SWF2_Pos)               /* (XDMAC_GSWF) XDMAC Channel 2 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF2(value)                (XDMAC_GSWF_SWF2_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF2_Pos)) /* Assigment of value for SWF2 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF3_Pos                   _UINT32_(3)                                          /* (XDMAC_GSWF) XDMAC Channel 3 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF3_Msk                   (_UINT32_(0x1) << XDMAC_GSWF_SWF3_Pos)               /* (XDMAC_GSWF) XDMAC Channel 3 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF3(value)                (XDMAC_GSWF_SWF3_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF3_Pos)) /* Assigment of value for SWF3 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF4_Pos                   _UINT32_(4)                                          /* (XDMAC_GSWF) XDMAC Channel 4 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF4_Msk                   (_UINT32_(0x1) << XDMAC_GSWF_SWF4_Pos)               /* (XDMAC_GSWF) XDMAC Channel 4 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF4(value)                (XDMAC_GSWF_SWF4_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF4_Pos)) /* Assigment of value for SWF4 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF5_Pos                   _UINT32_(5)                                          /* (XDMAC_GSWF) XDMAC Channel 5 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF5_Msk                   (_UINT32_(0x1) << XDMAC_GSWF_SWF5_Pos)               /* (XDMAC_GSWF) XDMAC Channel 5 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF5(value)                (XDMAC_GSWF_SWF5_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF5_Pos)) /* Assigment of value for SWF5 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF6_Pos                   _UINT32_(6)                                          /* (XDMAC_GSWF) XDMAC Channel 6 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF6_Msk                   (_UINT32_(0x1) << XDMAC_GSWF_SWF6_Pos)               /* (XDMAC_GSWF) XDMAC Channel 6 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF6(value)                (XDMAC_GSWF_SWF6_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF6_Pos)) /* Assigment of value for SWF6 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF7_Pos                   _UINT32_(7)                                          /* (XDMAC_GSWF) XDMAC Channel 7 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF7_Msk                   (_UINT32_(0x1) << XDMAC_GSWF_SWF7_Pos)               /* (XDMAC_GSWF) XDMAC Channel 7 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF7(value)                (XDMAC_GSWF_SWF7_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF7_Pos)) /* Assigment of value for SWF7 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF8_Pos                   _UINT32_(8)                                          /* (XDMAC_GSWF) XDMAC Channel 8 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF8_Msk                   (_UINT32_(0x1) << XDMAC_GSWF_SWF8_Pos)               /* (XDMAC_GSWF) XDMAC Channel 8 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF8(value)                (XDMAC_GSWF_SWF8_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF8_Pos)) /* Assigment of value for SWF8 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF9_Pos                   _UINT32_(9)                                          /* (XDMAC_GSWF) XDMAC Channel 9 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF9_Msk                   (_UINT32_(0x1) << XDMAC_GSWF_SWF9_Pos)               /* (XDMAC_GSWF) XDMAC Channel 9 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF9(value)                (XDMAC_GSWF_SWF9_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF9_Pos)) /* Assigment of value for SWF9 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF10_Pos                  _UINT32_(10)                                         /* (XDMAC_GSWF) XDMAC Channel 10 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF10_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF10_Pos)              /* (XDMAC_GSWF) XDMAC Channel 10 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF10(value)               (XDMAC_GSWF_SWF10_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF10_Pos)) /* Assigment of value for SWF10 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF11_Pos                  _UINT32_(11)                                         /* (XDMAC_GSWF) XDMAC Channel 11 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF11_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF11_Pos)              /* (XDMAC_GSWF) XDMAC Channel 11 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF11(value)               (XDMAC_GSWF_SWF11_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF11_Pos)) /* Assigment of value for SWF11 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF12_Pos                  _UINT32_(12)                                         /* (XDMAC_GSWF) XDMAC Channel 12 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF12_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF12_Pos)              /* (XDMAC_GSWF) XDMAC Channel 12 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF12(value)               (XDMAC_GSWF_SWF12_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF12_Pos)) /* Assigment of value for SWF12 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF13_Pos                  _UINT32_(13)                                         /* (XDMAC_GSWF) XDMAC Channel 13 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF13_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF13_Pos)              /* (XDMAC_GSWF) XDMAC Channel 13 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF13(value)               (XDMAC_GSWF_SWF13_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF13_Pos)) /* Assigment of value for SWF13 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF14_Pos                  _UINT32_(14)                                         /* (XDMAC_GSWF) XDMAC Channel 14 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF14_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF14_Pos)              /* (XDMAC_GSWF) XDMAC Channel 14 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF14(value)               (XDMAC_GSWF_SWF14_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF14_Pos)) /* Assigment of value for SWF14 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF15_Pos                  _UINT32_(15)                                         /* (XDMAC_GSWF) XDMAC Channel 15 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF15_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF15_Pos)              /* (XDMAC_GSWF) XDMAC Channel 15 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF15(value)               (XDMAC_GSWF_SWF15_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF15_Pos)) /* Assigment of value for SWF15 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF16_Pos                  _UINT32_(16)                                         /* (XDMAC_GSWF) XDMAC Channel 16 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF16_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF16_Pos)              /* (XDMAC_GSWF) XDMAC Channel 16 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF16(value)               (XDMAC_GSWF_SWF16_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF16_Pos)) /* Assigment of value for SWF16 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF17_Pos                  _UINT32_(17)                                         /* (XDMAC_GSWF) XDMAC Channel 17 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF17_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF17_Pos)              /* (XDMAC_GSWF) XDMAC Channel 17 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF17(value)               (XDMAC_GSWF_SWF17_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF17_Pos)) /* Assigment of value for SWF17 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF18_Pos                  _UINT32_(18)                                         /* (XDMAC_GSWF) XDMAC Channel 18 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF18_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF18_Pos)              /* (XDMAC_GSWF) XDMAC Channel 18 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF18(value)               (XDMAC_GSWF_SWF18_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF18_Pos)) /* Assigment of value for SWF18 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF19_Pos                  _UINT32_(19)                                         /* (XDMAC_GSWF) XDMAC Channel 19 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF19_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF19_Pos)              /* (XDMAC_GSWF) XDMAC Channel 19 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF19(value)               (XDMAC_GSWF_SWF19_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF19_Pos)) /* Assigment of value for SWF19 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF20_Pos                  _UINT32_(20)                                         /* (XDMAC_GSWF) XDMAC Channel 20 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF20_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF20_Pos)              /* (XDMAC_GSWF) XDMAC Channel 20 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF20(value)               (XDMAC_GSWF_SWF20_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF20_Pos)) /* Assigment of value for SWF20 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF21_Pos                  _UINT32_(21)                                         /* (XDMAC_GSWF) XDMAC Channel 21 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF21_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF21_Pos)              /* (XDMAC_GSWF) XDMAC Channel 21 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF21(value)               (XDMAC_GSWF_SWF21_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF21_Pos)) /* Assigment of value for SWF21 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF22_Pos                  _UINT32_(22)                                         /* (XDMAC_GSWF) XDMAC Channel 22 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF22_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF22_Pos)              /* (XDMAC_GSWF) XDMAC Channel 22 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF22(value)               (XDMAC_GSWF_SWF22_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF22_Pos)) /* Assigment of value for SWF22 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF23_Pos                  _UINT32_(23)                                         /* (XDMAC_GSWF) XDMAC Channel 23 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF23_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF23_Pos)              /* (XDMAC_GSWF) XDMAC Channel 23 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF23(value)               (XDMAC_GSWF_SWF23_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF23_Pos)) /* Assigment of value for SWF23 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF24_Pos                  _UINT32_(24)                                         /* (XDMAC_GSWF) XDMAC Channel 24 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF24_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF24_Pos)              /* (XDMAC_GSWF) XDMAC Channel 24 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF24(value)               (XDMAC_GSWF_SWF24_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF24_Pos)) /* Assigment of value for SWF24 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF25_Pos                  _UINT32_(25)                                         /* (XDMAC_GSWF) XDMAC Channel 25 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF25_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF25_Pos)              /* (XDMAC_GSWF) XDMAC Channel 25 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF25(value)               (XDMAC_GSWF_SWF25_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF25_Pos)) /* Assigment of value for SWF25 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF26_Pos                  _UINT32_(26)                                         /* (XDMAC_GSWF) XDMAC Channel 26 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF26_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF26_Pos)              /* (XDMAC_GSWF) XDMAC Channel 26 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF26(value)               (XDMAC_GSWF_SWF26_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF26_Pos)) /* Assigment of value for SWF26 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF27_Pos                  _UINT32_(27)                                         /* (XDMAC_GSWF) XDMAC Channel 27 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF27_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF27_Pos)              /* (XDMAC_GSWF) XDMAC Channel 27 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF27(value)               (XDMAC_GSWF_SWF27_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF27_Pos)) /* Assigment of value for SWF27 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF28_Pos                  _UINT32_(28)                                         /* (XDMAC_GSWF) XDMAC Channel 28 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF28_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF28_Pos)              /* (XDMAC_GSWF) XDMAC Channel 28 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF28(value)               (XDMAC_GSWF_SWF28_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF28_Pos)) /* Assigment of value for SWF28 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF29_Pos                  _UINT32_(29)                                         /* (XDMAC_GSWF) XDMAC Channel 29 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF29_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF29_Pos)              /* (XDMAC_GSWF) XDMAC Channel 29 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF29(value)               (XDMAC_GSWF_SWF29_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF29_Pos)) /* Assigment of value for SWF29 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF30_Pos                  _UINT32_(30)                                         /* (XDMAC_GSWF) XDMAC Channel 30 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF30_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF30_Pos)              /* (XDMAC_GSWF) XDMAC Channel 30 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF30(value)               (XDMAC_GSWF_SWF30_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF30_Pos)) /* Assigment of value for SWF30 in the XDMAC_GSWF register */
#define XDMAC_GSWF_SWF31_Pos                  _UINT32_(31)                                         /* (XDMAC_GSWF) XDMAC Channel 31 Software Flush Request Bit Position */
#define XDMAC_GSWF_SWF31_Msk                  (_UINT32_(0x1) << XDMAC_GSWF_SWF31_Pos)              /* (XDMAC_GSWF) XDMAC Channel 31 Software Flush Request Bit Mask */
#define XDMAC_GSWF_SWF31(value)               (XDMAC_GSWF_SWF31_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF31_Pos)) /* Assigment of value for SWF31 in the XDMAC_GSWF register */
#define XDMAC_GSWF_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (XDMAC_GSWF) Register Mask  */

#define XDMAC_GSWF_SWF_Pos                    _UINT32_(0)                                          /* (XDMAC_GSWF Position) XDMAC Channel 3x Software Flush Request Bit */
#define XDMAC_GSWF_SWF_Msk                    (_UINT32_(0xFFFFFFFF) << XDMAC_GSWF_SWF_Pos)         /* (XDMAC_GSWF Mask) SWF */
#define XDMAC_GSWF_SWF(value)                 (XDMAC_GSWF_SWF_Msk & (_UINT32_(value) << XDMAC_GSWF_SWF_Pos)) 

/** \brief XDMAC register offsets definitions */
#define XDMAC_CIE_REG_OFST             _UINT32_(0x00)      /* (XDMAC_CIE) Channel Interrupt Enable Register Offset */
#define XDMAC_CID_REG_OFST             _UINT32_(0x04)      /* (XDMAC_CID) Channel Interrupt Disable Register Offset */
#define XDMAC_CIM_REG_OFST             _UINT32_(0x08)      /* (XDMAC_CIM) Channel Interrupt Mask Register Offset */
#define XDMAC_CIS_REG_OFST             _UINT32_(0x0C)      /* (XDMAC_CIS) Channel Interrupt Status Register Offset */
#define XDMAC_CSA_REG_OFST             _UINT32_(0x10)      /* (XDMAC_CSA) Channel Source Address Register Offset */
#define XDMAC_CDA_REG_OFST             _UINT32_(0x14)      /* (XDMAC_CDA) Channel Destination Address Register Offset */
#define XDMAC_CNDA_REG_OFST            _UINT32_(0x18)      /* (XDMAC_CNDA) Channel Next Descriptor Address Register Offset */
#define XDMAC_CNDC_REG_OFST            _UINT32_(0x1C)      /* (XDMAC_CNDC) Channel Next Descriptor Control Register Offset */
#define XDMAC_CUBC_REG_OFST            _UINT32_(0x20)      /* (XDMAC_CUBC) Channel Microblock Control Register Offset */
#define XDMAC_CBC_REG_OFST             _UINT32_(0x24)      /* (XDMAC_CBC) Channel Block Control Register Offset */
#define XDMAC_CC_REG_OFST              _UINT32_(0x28)      /* (XDMAC_CC) Channel Configuration Register Offset */
#define XDMAC_CDS_MSP_REG_OFST         _UINT32_(0x2C)      /* (XDMAC_CDS_MSP) Channel Data Stride Memory Set Pattern Offset */
#define XDMAC_CSUS_REG_OFST            _UINT32_(0x30)      /* (XDMAC_CSUS) Channel Source Microblock Stride Offset */
#define XDMAC_CDUS_REG_OFST            _UINT32_(0x34)      /* (XDMAC_CDUS) Channel Destination Microblock Stride Offset */
#define XDMAC_GTYPE_REG_OFST           _UINT32_(0x00)      /* (XDMAC_GTYPE) Global Type Register Offset */
#define XDMAC_GCFG_REG_OFST            _UINT32_(0x04)      /* (XDMAC_GCFG) Global Configuration Register Offset */
#define XDMAC_GWAC_REG_OFST            _UINT32_(0x08)      /* (XDMAC_GWAC) Global Weighted Arbiter Configuration Register Offset */
#define XDMAC_GIE_REG_OFST             _UINT32_(0x0C)      /* (XDMAC_GIE) Global Interrupt Enable Register Offset */
#define XDMAC_GID_REG_OFST             _UINT32_(0x10)      /* (XDMAC_GID) Global Interrupt Disable Register Offset */
#define XDMAC_GIM_REG_OFST             _UINT32_(0x14)      /* (XDMAC_GIM) Global Interrupt Mask Register Offset */
#define XDMAC_GIS_REG_OFST             _UINT32_(0x18)      /* (XDMAC_GIS) Global Interrupt Status Register Offset */
#define XDMAC_GE_REG_OFST              _UINT32_(0x1C)      /* (XDMAC_GE) Global Channel Enable Register Offset */
#define XDMAC_GD_REG_OFST              _UINT32_(0x20)      /* (XDMAC_GD) Global Channel Disable Register Offset */
#define XDMAC_GS_REG_OFST              _UINT32_(0x24)      /* (XDMAC_GS) Global Channel Status Register Offset */
#define XDMAC_GRS_REG_OFST             _UINT32_(0x28)      /* (XDMAC_GRS) Global Channel Read Suspend Register Offset */
#define XDMAC_GWS_REG_OFST             _UINT32_(0x2C)      /* (XDMAC_GWS) Global Channel Write Suspend Register Offset */
#define XDMAC_GRWS_REG_OFST            _UINT32_(0x30)      /* (XDMAC_GRWS) Global Channel Read Write Suspend Register Offset */
#define XDMAC_GRWR_REG_OFST            _UINT32_(0x34)      /* (XDMAC_GRWR) Global Channel Read Write Resume Register Offset */
#define XDMAC_GSWR_REG_OFST            _UINT32_(0x38)      /* (XDMAC_GSWR) Global Channel Software Request Register Offset */
#define XDMAC_GSWS_REG_OFST            _UINT32_(0x3C)      /* (XDMAC_GSWS) Global Channel Software Request Status Register Offset */
#define XDMAC_GSWF_REG_OFST            _UINT32_(0x40)      /* (XDMAC_GSWF) Global Channel Software Flush Request Register Offset */

